[
    {
        "title": "3.7M FlexBooker Records Dumped on Hacker Forum",
        "author": "Becky Bracken",
        "date": "2022-01-07T14:12:20-05:00",
        "text": "Attackers are trading millions of records from a trio of pre-holiday breaches on an online forum.\nA threat group that identifies itself as Uawrongteam is dumping data stolen from FlexBooker – a popular online appointment scheduling tool for booking services ranging from counseling to haircuts – on a cybercriminal forum.\nThe data from FlexBooker is being offered up by Uawrongteam, along with other databases stolen on the same day, Dec. 23, from Racing.com and Redbourne Group’s rediCASE case management software, BleepingComputer reported.\nFlexBooker sent a notification to its users, explaining that its Amazon AWS servers were compromised by what the company was able to identify as a distributed denial-of-service (DDoS) attack. FlexBooker customers include the brands GoDaddy, Chipotle, Bausch + Lomb and Krewe.\nI got this email too and I wonder 🤔 @amazon pic.twitter.com/wr6XSLL6MX\n— Mooniter (@mooniter) January 6, 2022\n“After working further with Amazon to understand what happened, we learned a certain set of data, including personal information of some customers, was accessed and downloaded,” the company said.\nMore than 3.7M FlexBook Records Up For Grabs\nAccording to Have I Been Pwned, the FlexBooker breach compromised 3.7 million accounts with information including email addresses, names, phone numbers and, for some, partial credit card data.\nNew breach: Online booking service FlexBooker had 3.7M accounts breached last month. Data included email addresses, names, phone numbers and for some accounts, partial credit card data. 69% were already in @haveibeenpwned https://t.co/LGaAnj1hUA\n— Have I Been Pwned (@haveibeenpwned) January 6, 2022\nUawrongteam claimed that its stolen database contains 10 million lines, including payment details.\nFlexBooker said in its disclosure that it considers the matter resolved and is “… still monitoring for any lingering issues.”\nBut the attack might not be over, warned Nasser Fattah with Shared Assessments.\n“We know that there are financial losses associated with system outages, hence, why security teams have all eyes on glass, so to speak, when there is a DDoS attack,” Fattah explained to Threatpost on Friday. “And when this happens, it is important to be prepared for the possibility of a multifaceted attack and be very diligent with monitoring other anomalies happening on the network.”\nImage courtesy of Pixabay. Licensing details.\nPassword Reset: On-Demand Event: Fortify 2022 with a password-security strategy built for today’s threats. This Threatpost Security Roundtable, built for infosec professionals, centers on enterprise credential management, the new password basics and mitigating post-credential breaches. Join Darren James, with Specops Software and Roger Grimes, defense evangelist at KnowBe4 and Threatpost host Becky Bracken. Register & stream this FREE session today – sponsored by Specops Software.\nWrite a comment\nShare this article:\nBreach\nNews",
        "blog": "threat post",
        "url": "https://threatpost.com/flexbooker-records-dumped-hacker-forum/177460/"
    },
    {
        "title": "Activision Files Unusual Lawsuit over Call of Duty Cheat Codes",
        "author": "Becky Bracken",
        "date": "2022-01-06T14:48:04-05:00",
        "text": "Activision is suing to shut down the EngineOwning cheat-code site and hold individual developers and coders liable for damages.\nActivision, publisher of the enormously popular gaming franchise Call of Duty, has taken an extraordinary step to try and shut down cheat software by suing the popular site EngineOwning (EO).\nEO develops and sells software tools to players looking for an edge. EO cheats for Call of Duty include “aimbots” which automatically train the shooter’s weapon on the opponent; “triggerbots” that automatically fire at another player when they become visible on-screen; and a feature the lawsuit calls “ESP and 2D/3D Radar,” which allows gamers to see opposing players through walls.\nAttorneys for Activision argue EO’s cheating exploits are nothing more than illegal software hacks that disturb the competitive balance of the game, driving players to quit and publicly bash the game on social media.\n“Activision has spent and continues to spend an enormous amount of resources to combat cheating in games,” the filing added. “Notwithstanding those efforts, defendants’ sale and distribution of the cheating software has caused Activision to suffer massive and irreparable damage to its goodwill and reputation and to lose substantial revenue.”\nCybersecurity researchers have also long noted the relationship between cybercrime and cheat codes — they offer an ideal conduit for launching malware on gamer machines. For instance, last April, threat actors disguised COD-Dropper v0.1 malware as cheat programs for Call of Duty: Warzone to infect video-game players.\nNaming Individuals\nBesides seeking to shutter the site for good, Activision has also named individual EO coders, developers, marketers and other employees as defendants in its lawsuit filed this week in California court.\nEO is based in Germany, and Activision specifically names German residents EO chief Valentin Rick; Leonard Bugla, the operations administrator of EO during 2019 and 2020; and the alleged site moderator Leon Frisch — as well as other staffers accused of developing, distributing, coding, and even providing technical and customer support for the Call of Duty cheat software.\n“This case is particularly interesting because the lawsuit was not only filed against the cheat provider EngineOwning, but also against individuals involved with the sale and development of the game cheats,” Jake Williams, CTO with BreachQuest told Threatpost in reaction to the lawsuit. “Targeting individuals by name with legal action is important because it will likely rattle those involved in the game-cheat economy who are assisting in, but do not have an ownership stake in the operation. I suspect this was done primarily to rattle others in the game-cheat economy and force them to reevaluate their risk calculus.”\nNeither Activision nor EO responded to Threatpost’s request for comment on the lawsuit.\nCall of Duty Made $3 Billion in 2020 Alone\nFor some idea of the scope of the damages sought, Activision reported in the court filing that the Call of Duty game franchise generated $3 billion in 2020 alone.\n“By this lawsuit, Activision seeks to put a stop to unlawful conduct by an organization that is distributing and selling for profit numerous malicious software products designed to enable members of the public to gain an unfair competitive advantages (i.e., to cheat) in the COD games,” the lawsuit filing said.\nCOD Cheats Still Available on EO Site\nThe legal threats don’t seem to have had the desired effect so far. As of Thursday, the EngineOwning site still offered cheats for Call of Duty: Modern Warfare and Warzone for as little as 3.89€ for three days. Cheats for several other Call of Duty games including Black Ops 2, Black Ops 3 and WW2 were all available for purchase, as seen in this screengrab taken by Threatpost:\nThe defendants are accused by Activision of violating the game’s terms of use, employing a circumvention device and copyright infringement. The suit said the company is seeking maximum damages and attorneys’ fees.\n“Cheat engines aren’t just a nuisance for Activision,” Williams added. “Those involved in providing services that involve terms of service (ToS) violations should watch this lawsuit carefully – the legal departments of the organizations whose back’s they’re profiting off of certainly are.”\nPassword Reset: On-Demand Event: Fortify 2022 with a password-security strategy built for today’s threats. This Threatpost Security Roundtable, built for infosec professionals, centers on enterprise credential management, the new password basics and mitigating post-credential breaches. Join Darren James, with Specops Software and Roger Grimes, defense evangelist at KnowBe4 and Threatpost host Becky Bracken. Register & stream this FREE session today – sponsored by Specops Software.\nWrite a comment\nShare this article:\nHacks\nMalware\nWeb Security",
        "blog": "threat post",
        "url": "https://threatpost.com/activision-lawsuit-call-of-duty-cheat-codes/177443/"
    },
    {
        "title": "Google Voice Authentication Scam Leaves Victims on the Hook",
        "author": "Lisa Vaas",
        "date": "2022-01-06T12:28:43-05:00",
        "text": "The FBI is seeing so much activity around malicious Google Voice activity, where victims are associated with fraudulent virtual phone numbers, that it sent out an alert this week.\nFluffy is missing.\nYou post your lost pet’s photo online, hoping that some good Samaritan will find Fluffy, listing your phone number and crossing your fingers.\nYou get a text or email from somebody who thinks they’ve found Fluffy – or, say, somebody who wants to buy that scruffy old couch you posted for sale on Craigslist.\nThe purported lost-pet-finder/old-couch-aficionado tells you they don’t want to get scammed, though. They’ve heard about fake online listings and want to verify that you’re a real person and not a bot, or they might say that they want to verify that you’re the pet’s true owner.\nSo they tell you they will send you a Google authentication code in the form of a voice call or a text message, and then ask you to repeat the number back to them to prove you’re real.\nIn reality, they’re setting up a Google Voice account in your name, using your phone number, and the “authentication” code is actually the two-step verification code needed to complete the set-up process.\nThere are a growing number of scammers are rolling out this Google Voice scam — to the point where the FBI was moved to issue a warning about them this week.\nWhy Google Voice?\nThe Google Voice service offers virtual phone number that can be used to make domestic and international calls, or send and receive text messages from a browser. That account can be used to launch any number of scams, the FBI said, all without the ability to be traced directly back to the scammer. As well, the code can be used to gain access to, and hijack, Gmail accounts.\nThe scammers often use the Google Voice number in fraudulent ads on marketplace websites or for other criminal activity, hiding their true identity and leaving the victim looking like the guilty party. Sometimes the scammers are also looking for other information about the target that they can use to access online accounts or open new accounts in the victim’s name.\nAlthough the message Google sends out warns recipients not to share the number with anyone, in at least one case, the scammers disguised the message by having it sent in a foreign language. As Nerd Wallet reported last month, journalist Kelly Rissman of New York, who had listed furniture for sale, got contacted by a scammer. A six-digit code from Google followed quickly, along with something written in Filipino. Had she translated it, she would have seen that it read: “—— is your Google Voice verification code. Don’t share it with anyone else.”\nGoogle Voice verification code. Source: FTC.\nAnatomy of a Google Voice Scam\nAs the Federal Trade Commission (FTC) explained in October, this is how a Google Voice verification code scam typically works:\nA criminal downloads the Google Voice app and links it to a Gmail account.\nThey find victims by checking out online marketplaces, looking for people who post things for sale on sites like Craigslist or Facebook Marketplace. They also prey on people who post looking for help finding a lost pet and have been known to run the scam on dating sites.\nThey say they’ve been burned in the past by bots and ask the seller/pet owner to accept and text back a code to prove they’re a real person.\nWhen the victim texts the code back, the scammer can link the Google Voice number to the victim’s authenticated phone.\nThis is a tough scam to detect, given that targets aren’t asked for personal data or account numbers, and, as Rissman noted, she hadn’t forked over any way to steal her identity or her money.\nAs of September, the Identity Theft Resource Center (ITRC) reported that the scam is booming: nearly half – 49 percent – of the complaints they received in the prior month were about the Google Voice scam.\nHow to Avoid the Google Voice Scam\nThe FBI offered these ways for consumers to protect themselves from falling victims to such gambits:\nNever share a Google verification code of any kind with others.\nOnly deal with buyers, sellers and Fluffy-finders in person. If money is to exchange hands, make sure you are using legitimate payment processors.\nDon’t give out your email address to buyers/sellers conducting business via phone.\nDon’t let someone rush you into a sale. If they are pressuring you to respond, they are likely trying to manipulate you into acting without thinking.\nImage courtesy of Cory Doctorow. Licensing details.\nPassword Reset: On-Demand Event: Fortify 2022 with a password-security strategy built for today’s threats. This Threatpost Security Roundtable, built for infosec professionals, centers on enterprise credential management, the new password basics and mitigating post-credential breaches. Join Darren James, with Specops Software and Roger Grimes, defense evangelist at KnowBe4 and Threatpost host Becky Bracken. Register & stream this FREE session today – sponsored by Specops Software.\nWrite a comment\nShare this article:\nMobile Security\nWeb Security",
        "blog": "threat post",
        "url": "https://threatpost.com/google-voice-authentication-scam/177421/"
    },
    {
        "title": "Partially Unpatched VMware Bug Opens Door to Hypervisor Takeover",
        "author": "Tara Seals",
        "date": "2022-01-06T11:47:44-05:00",
        "text": "ESXi version 7 users are still waiting for a full fix for a high-severity heap-overflow security vulnerability, but Cloud Foundation, Fusion and Workstation users can go ahead and patch.\nA security vulnerability in VMware’s Cloud Foundation, ESXi, Fusion and Workstation platforms could pave the way for hypervisor takeover in virtual environments – and a patch is still pending for some users.\nThe issue affects a wide swath of the virtualization specialist’s portfolio and affects Windows, Linux and Mac users. Details about the platforms:\nCloud Foundation is VMware’s multicloud management platform, providing software-defined services for compute, storage, network, security, Kubernetes and so on.\nESXi is a bare-metal hypervisor that installs on a server and partitions it into multiple virtual machines (VMs).\nFusion is a software hypervisor that allows Intel-based Macs to run VMs with guest operating systems – such as Microsoft Windows, Linux, NetWare, Solaris or macOS.\nWorkstation enables users to set up VMs on a single physical machine.\nThe bug (CVE-2021-22045) is a high-severity heap-overflow vulnerability carrying a CVSS rating of 7.7 out of 10. Heap overflows are memory issues that can result in data corruption or unexpected behavior by any process that accesses the affected memory area – in some cases resulting in remote code execution (RCE).\nIn this case, the problem specifically exists in the CD-ROM device emulation function of the affected products.\n“A malicious actor with access to a virtual machine with CD-ROM device emulation may be able to exploit this vulnerability in conjunction with other issues, to execute code on the hypervisor from a virtual machine,” the vendor noted in its advisory. “Successful exploitation requires a CD image to be attached to the virtual machine.”\nReno Robert, senior vulnerability researcher for Trend Micro’s Zero Day Initiative, told Threatpost that the issue results from “the lack of proper validation of the length of user-supplied data prior to copying it to a fixed-length heap-based buffer.”\nComplex but Dangerous Exploitation\nRobert added that even though the bug allows an untrusted guest OS user to execute code on the hypervisor, “an attacker would not have control over the data written, so exploitation this would be difficult.”\nHence the need to be used “in conjunction with other issues.” Reno explained that an example of other issues “could be an information-disclosure vulnerability that provide details on the memory layout. This would making exploitation more feasible.”\nIf successful though, attackers could compromise the host operating system of the hypervisor. Taking over a hypervisor, which is the highly privileged software that creates and runs VMs and governs how resources are shared among them (such as memory and processing), can give cybercriminals a clear path to accessing any of the data or applications stored in the VMs it controls, and executing code or installing files on those VMs, depending on the security controls that are implemented.\nResearcher “Jaanus K\\xc3\\xa4\\xc3\\xa4p” with Clarified Security and Trend Micro’s ZDI were credited with discovering the bug.\nPatch VMware CVE-2021-22045 Now\nAffected product versions are: ESXi 6.5, 6.7 and 7 (version 7 remains unpatched for now); Fusion 12.x; Workstation 16.x; and all versions of VMware Cloud Foundation. Patch information can be found in the vendor’s advisory.\nUsers should patch as soon as possible, given that VMware is a favorite target for cybercriminals. For instance, just days after a critical CVE-2021-22005 RCE vulnerability in VMware vCenter was disclosed, a full working exploit was public and being used in the wild.\nESXi users are especially at risk: While the solution makes it easy for multiple VMs to share the same hard-drive storage, it also sets systems up to be one-stop shopping spots for attacks, researchers say, since attackers can target the centralized virtual hard drives used to store data from across VMs.\n“ESXi servers represent an attractive target for ransomware threat actors because they can attack multiple VMs at once, where each of the VMs could be running business-critical applications or services,” Andrew Brandt, principal researcher at Sophos, recently explained. “Attacks on hypervisors can be both fast and highly disruptive.”\nHe was discussing a spate of attacks in October that used a Python code that took less than three hours to complete a ransomware attack on ESXi servers, from initial breach to encryption. That incident joined other ransomware efforts targeting the hypervisor: REvil ransomware threat actors last year came up with a Linux variant that targeted VMware ESXi; and in September HelloKitty joined the growing list going after the juicy target. DarkSide also targeted ESXi servers last year.\nWorkaround for ESXi v.7 Users\nOf course, all of that is bad news for ESXi v.7 users, who don’t yet have a patch for this latest bug. VMware did, however, issue a workaround that can be used for now, involving disabling CD-ROM/DVD functionality.\nThe steps are:\nLog in to a vCenter Server system using the vSphere Web Client.\nRight-click the virtual machine and click Edit Settings.\nSelect the CD/DVD drive and uncheck “Connected” and “Connect at power on” and remove any attached ISOs.\nTo enumerate the VMs that have a CD-ROM/DVD device attached, users can run the following command, according to the vendor:\nGet-VM | Get-CDDrive | Where {$_.extensiondata.connectable.connected -eq $true} | Select Parent\nThen the following command will remove and disconnect the attached CD-ROM/DVD device:\nGet-VM | Get-CDDrive | Where {$_.extensiondata.connectable.connected -eq $true} | Set-CDDrive -NoMedia -confirm:$false\nPassword Reset: On-Demand Event: Fortify 2022 with a password-security strategy built for today’s threats. This Threatpost Security Roundtable, built for infosec professionals, centers on enterprise credential management, the new password basics and mitigating post-credential breaches. Join Darren James, with Specops Software and Roger Grimes, defense evangelist at KnowBe4 and Threatpost host Becky Bracken. Register & stream this FREE session today – sponsored by Specops Software.\n  Write a comment\nShare this article:\nCloud Security\nVulnerabilities",
        "blog": "threat post",
        "url": "https://threatpost.com/unpatched-vmware-bug-hypervisor-takeover/177428/"
    },
    {
        "title": "Apple iPhone Malware Tactic Causes Fake Shutdowns to Enable Spying",
        "author": "Tara Seals",
        "date": "2022-01-06T10:44:27-05:00",
        "text": "The ‘NoReboot’ technique is the ultimate in persistence for iPhone malware, preventing reboots and enabling remote attackers to do anything on the device while remaining completely unseen.\nIn the world of mobile malware, simply shutting down a device can often wipe out any bad code, given that persistence after rebooting is a challenge for traditional malicious activity. But a new iPhone technique can hijack and prevent any shut-down process that a user initiates, simulating a real power-off while allowing malware to remain active in the background.\nThe stealthy technique, dubbed “NoReboot” by researchers, is “the ultimate persistence bug,” according to a ZecOps analysis this week. The firm also debuted a proof of concept (PoC) showing how to use a faked shutdown to disguise remote spying activity (see below).\nThe tactic provides a perfect cover for malicious activity, since an infected user might think “that the phone has been powered off, but in fact, it’s still running,” researchers explained. “The NoReboot approach simulates a real shutdown. The user cannot feel a difference between a real shutdown and a fake shutdown. There is no user-interface or any button feedback until the user turns the phone back ‘on’…we cannot, and should not, trust a normal reboot.”\nFaking an iPhone Shutdown\nTypically, users turn off their iPhones by holding down the volume down and power button at the same time, then sliding the “power off” slider on the touchscreen. After that, the only real indication that the phone is actually off is the fact that the screen is unresponsive and doesn’t “wake up” when tapped or when the side button is clicked; and, of course, calls, text and app notifications cease.\nTo simulate this state, NoReboot starts by injecting code into three daemons responsible for controlling the shutdown event, according to ZecOps: InCallService, SpringBoard and backboardd.\n“When you slide to power off, it is actually a system application /Applications/InCallService.app sending a shutdown signal to SpringBoard, which is a daemon that is responsible for the majority of the UI interaction,” researchers explained, in the analysis. “We managed to hijack the signal by hooking the Objective-C method -[FBSSystemService shutdownWithOptions:]. Now instead of sending a shutdown signal to SpringBoard, it will notify both SpringBoard and backboardd to trigger the code we injected into them.”\nThe code forces SpringBoard to exit, also blocking it from launching again.\n“Because SpringBoard is responsible for responding to user behavior and interaction, without it, the device looks and feels as if it is not powered on,” according to ZecOps.\nAt this point, there’s no physical indication that the iPhone is on, but it remains fully awake and connected to the internet. That allows nefarious types to wantonly do what they wish on the device without fear of discovery. In the ZecOps PoC, researchers were able to eavesdrop on test users via both the camera and the microphone, all while the phone appeared to be turned off.\n“In reality, malicious actors can do anything the end user can do, and more,” according to the analysis.\nZecOps’ PoC can be found on GitHub, and here’s a video demo of it:\nFrom a practical perspective, researchers pointed out that the technique could be built into malware designed to detect when a user is trying to turn off the phone; or the malware could simulate a “low battery” state to use as an excuse for a “shutdown.”\nWhat Happens when the iPhone is Powered On?\nWhen a user goes to turn the phone back on, the normal routine is that the Apple logo appears as the phone wakes up.\nNoReboot can simulate this as well, to maintain the illusion and convince the user that the iPhone has, indeed, been successfully powered off and then restarted. Once again, this is accomplished by hijacking the process through code injection.\n“When SpringBoard is not on duty, backboardd is in charge of the screen,” researchers explained. “[It] logs the exact time when a button is pressed down [to restart the device], and when it’s been released.”\nNoReboot intercepts this process, they noted: The button press event is recorded and inserted into a global dictionary object (BKEventSenderUsagePairDictionary). The insertion can be hooked using the Objective-C method.\n“The file will unleash the SpringBoard and trigger a special code block in our injected dylib,” according to ZecOps. “What it does is to leverage local SSH access to gain root privilege, then we execute /bin/launchctl reboot userspace. This will exit all processes and restart the system without touching the kernel. The kernel remains patched. Hence malicious code won’t have any problem continuing to run after this kind of reboot.”\nIs There a Patch for NoReboot?\nZecOps researchers noted that even though they call the issue a “persistence bug,” it can’t actually be patched because “it’s not exploiting any…bugs at all — only playing tricks with the human mind.” Via Twitter, the firm said that the technique works on every version of iPhone, and to prevent it, Apple would need to build in a hardware-based indicator for iPhone sleep/wake/off status.\nTo protect themselves, iPhone users should run standard checks for malware and trojanized apps, and take the usual vetting precautions when downloading and installing new apps.\nPassword Reset: On-Demand Event: Fortify 2022 with a password-security strategy built for today’s threats. This Threatpost Security Roundtable, built for infosec professionals, centers on enterprise credential management, the new password basics and mitigating post-credential breaches. Join Darren James, with Specops Software and Roger Grimes, defense evangelist at KnowBe4 and Threatpost host Becky Bracken. Register & stream this FREE session today – sponsored by Specops Software.\n  Write a comment\nShare this article:\nMalware\nMobile Security",
        "blog": "threat post",
        "url": "https://threatpost.com/apple-iphone-malware-fake-shutdowns-spying/177420/"
    },
    {
        "title": "Attackers Exploit Flaw in Google Docs’ Comments Feature",
        "author": "Elizabeth Montalbano",
        "date": "2022-01-06T09:00:44-05:00",
        "text": "A wave of phishing attacks identified in December targeting mainly Outlook users are difficult for both email scanners and victims to flag, researchers said.\nAttackers are using the “Comments” feature of Google Docs to send malicious links in a phishing campaign targeted primarily at Outlook users, researchers have discovered.\nResearchers from email collaboration and security firm Avanan, a CheckPoint company, first observed “a new, massive wave of hackers leveraging the comment feature in Google Docs” in December, Avanan Cybersecurity Researcher/Analyst Jeremy Fuchs wrote in a report published Thursday.\nAvanan first identified that the Comments feature of Google Docs, Sheets and Slides could be exploited to send spam emails in October, but so far Google has not responded to the issue, Fuchs wrote.\n“This known vulnerability has not been fully closed or mitigated by Google since then,” he wrote in the report.\nSo far, attackers have hit more than 500 inboxes across 30 tenants from more than 100 different Gmail accounts by exploiting the feature of Google’s cloud-based word processing app, according to the report.\nAttackers target users of Google Docs by adding a comment to a document that mentions the targeted user with an “@,” which automatically sends an email to that person’s inbox. That email, which comes from Google, includes text as well as the malicious links, Fuchs said.\nAn example using the same method to exploit Google Slides, the suite’s presentation app, is included in the report.\nEvading Detections\nThere are a number of reasons it’s hard for victims to recognize that the email sent to them after being tagged in Comments is malicious, Fuchs noted. For one, the email address of the sender isn’t shown – just the name of the attacker – which allows bad actors to impersonate legitimate entities to target victims, Fuchs observed.\nIt also “makes it harder for anti-spam filters to judge, and even harder for the end-user to recognize,” he wrote.\n“For example, a hacker can create a free Gmail account, such as <bad.actor@gmail.com>,” Fuchs explained. “They can then create a Google Doc and send it to their intended target.”\nThe malicious intent of the Comments mention is difficult to detect because the end user will have no idea whether the comment came from <bad.actor@gmail.com> or <bad.actor@company.com>, he noted.\n“It will just say ‘Bad Actor’ mentioned you in a comment in the following document,” Fuchs wrote. “If Bad Actor is a colleague, it will appear trusted.”\nThe email also contains the full comment, along with links and text, which means the victim never has to go to the document, as the payload is in the email itself.\n“Finally, the attacker doesn’t even have to share the document – just mentioning the person in the comment is enough,” Fuchs wrote.\nTypical protections won’t flag the emails because the notification comes directly from Google, which “is on most ‘Allow Lists’ and is trusted by users,” Fuchs wrote. Indeed, he said Advanced Threat Protection missed the attack vector in its scan.\nGoogle Docs as Attack Surface\nThe campaign appears to signify a ramp up in attacks to exploit the Comments feature of Google’s collaboration apps for malicious intent – attacks that likely will continue if left unchecked, researchers said.\nJune was the first time Avanan researchers identified threat actors hosting phishing attacks from within Google Docs, delivering malicious links aimed at stealing victims’ credentials. At the time, they identified it as a novel exploit of the app.\nThen, in October, as previously mentioned, researchers identified threat actors exploiting the Comments feature for the first time, followed by December’s flurry of attacks, which were reported to Google on Jan. 3 “using the resulting phishing via email through Google’s built-in tools,” Fuchs wrote.\nAvanan recommends that users cross-reference the email address in the comment to ensure it’s legitimate before clicking on a Google Docs comment. They also recommend standard “cyber hygiene” when reviewing comments, including scrutinizing links and inspecting grammar, according to the report.\n“If unsure, reach out to the legitimate sender and confirm they meant to send that,” Fuchs advised.\nSecurity professionals can guard against the attacks by deploying security protection that secures the entire suite, including file-sharing and collaboration apps, he added.\nPassword Reset: On-Demand Event: Fortify 2022 with a password security strategy built for today’s threats. This Threatpost Security Roundtable, built for infosec professionals, centers on enterprise credential management, the new password basics and mitigating post-credential breaches. Join Darren James, with Specops Software and Roger Grimes, defense evangelist at KnowBe4 and Threatpost host Becky Bracken. Register & Stream this FREE session today – sponsored by Specops Software.\nWrite a comment\nShare this article:\nVulnerabilities\nWeb Security",
        "blog": "threat post",
        "url": "https://threatpost.com/attackers-exploit-flaw-google-docs-comments/177412/"
    },
    {
        "title": "1.1M Compromised Accounts Found at 17 Major Companies",
        "author": "Tara Seals",
        "date": "2022-01-05T18:13:43-05:00",
        "text": "The accounts fell victim to credential-stuffing attacks, according to the New York State AG.\nThere have been more than 1.1 million online accounts compromised in a series of credential-stuffing attacks against 17 different companies, according to a New York State investigation.\nCredential-stuffing attacks, such as last year’s attack on Spotify, use automated scripts to try high volumes of usernames and password combinations against online accounts in an effort to take them over. Once in, cybercriminals can use the compromised accounts for various purposes: As a pivot point to penetrate deeper into a victim’s machine and network; to drain accounts of sensitive information (or monetary value); and if it’s an email account, they can impersonate the victim for attacks on others.\nSuch attacks are often successful thanks to password reuse and the use of common/easy-to-guess passwords, like “123456.” And they’re costly: The Ponemon Institute’s Cost of Credential Stuffing report found that businesses lose an average of $6 million per year to credential stuffing in the form of application downtime, lost customer, and increased IT costs.\n“With over 8.4 billion passwords in the wild and over 3.5 billion of those passwords tied to actual email addresses, it provides a starting point and easy attack vector for cybercriminals to target various online sites that utilize accounts for their customers,” said James McQuiggan, security awareness advocate at KnowBe4, via email. “These types of attacks give access to personal information about the user, their tax information and of course, their Social Security numbers for them and possibly their immediate family. Additionally, cybercriminals recognize that many organizations or users will not implement additional security measures and use the same password across various website accounts.”\nTo examine the extent of the problem, the Office of the AG embarked on a months-long examination of activity in underground cybercrime forums dedicated to credential stuffing.\n“The OAG found thousands of posts that contained customer login credentials that attackers had tested in a credential stuffing attack and confirmed could be used to access customer accounts at websites or on apps,” according to a Wednesday media statement.\nThe 17 affected organizations are “well-known online retailers, restaurant chains and food delivery services,” the office added.\nThe OAG alerted the relevant companies so that passwords could be reset and consumers could be notified, it said. The companies’ own internal investigations revealed that most of the attacks had not previously been detected, so nearly all of the companies implemented, or made plans to implement, additional safeguards, including: bot detection services; multifactor authentication; and password-less authentication.\n“Right now, there are more than 15 billion stolen credentials being circulated across the internet, as users’ personal information stand in jeopardy,” said New York Attorney General Letitia James. “Businesses have the responsibility to take appropriate action to protect their customers’ online accounts and this guide lays out critical safeguards companies can use in the fight against credential stuffing. We must do everything we can to protect consumers’ personal information and their privacy.”\nUsers should beware follow-on attacks as well, researchers added.\n“Like many people today, I have a neighborhood-watch application which alerts me to things happening in my community,” said Ron Bradley, vice president of Shared Assessments, via email. “Oftentimes people will post videos of threat actors checking the locks on cars and home doors…this perimeter ‘doorknob’ testing is similar to the recent announcement by the New York OAG. The fact is, there are billions of compromised credentials easily available on the internet. Threat actors will constantly use these resources in an attempt to breach digital assets.”\nHow to Protect Against Credential-Stuffing Attacks\nBradley offered additional defender advice: “In this case, the importance of identity and access management (IAM) cannot be overstated.  Organizations absolutely must enforce multiple layers of protection, especially when it comes to accessing sensitive data. The equation to combat this issue is straight forward.”\nThe ideal approach includes the following, he said:\nStrong passwords are good, but passphrases are better\nPrivileged access should always be accompanied with multifactor authentication\nThrottle internet-facing applications to prevent brute-force login attempts\nDetection and response mechanisms must be deployed and validated regularly\n“These are just a few of the fundamental controls needed to protect your data,” Bradley concluded. “It’s important to remember your digital asset boundary is like squeezing a balloon. You can tighten one side, but the other side expands. The challenge is finding that middle ground. When third parties are involved, the task becomes increasingly difficult as you must ensure they are following no less than the controls you’ve specified.”\nEveryone should also stop using old passwords that were involved in data breaches, McQuiggan noted: “The easiest way to see if one’s accounts have been involved in a breach is to check the HaveIBeenPwned.com website, which tracks email addresses and phone numbers that have been in data breaches over the past fifteen years.”\nPassword Reset: On-Demand Event: Fortify 2022 with a password-security strategy built for today’s threats. This Threatpost Security Roundtable, built for infosec professionals, centers on enterprise credential management, the new password basics and mitigating post-credential breaches. Join Darren James, with Specops Software and Roger Grimes, defense evangelist at KnowBe4 and Threatpost host Becky Bracken. Register & stream this FREE session today – sponsored by Specops Software.\n  Write a comment\nShare this article:\nBreach\nWeb Security",
        "blog": "threat post",
        "url": "https://threatpost.com/compromised-accounts-17-major-companies/177417/"
    },
    {
        "title": "‘Elephant Beetle’ Lurks for Months in Networks",
        "author": "Lisa Vaas",
        "date": "2022-01-05T17:18:28-05:00",
        "text": "The group blends into an environment before loading up trivial, thickly stacked, fraudulent financial transactions too tiny to be noticed but adding up to millions of dollars.\nResearchers have identified a threat group that’s been quietly siphoning off millions of dollars from financial- and commerce-sector companies, spending months patiently studying their targets’ financial systems and slipping in fraudulent transactions amongst regular activity.\nThe Sygnia Incident Response team has been tracking the group, which it named Elephant Beetle, aka TG2003, for two years.\nIn a Wednesday report, the researchers called Elephant Beetle’s attack relentless, as the group has hidden “in plain sight” without the need to develop exploits.\nMaybe Elephant Beetle doesn’t have exploits, but the attackers certainly don’t show up empty-handed. They rely on an arsenal of more than 80 unique tools and scripts to operate undetected “for vast amounts of time” as they patiently plant their bogus transactions, Sygnia said, “blending in with the target’s environment and going completely undetected while it quietly liberates organizations of exorbitant amounts of money.”\nElephant Beetle primarily focuses its attention on the Latin American market, but it doesn’t spare organizations that aren’t based there. Sygnia’s IR team recently discovered and responded to one incident at a company based in the U.S. that runs a branch in Latin America. “As such, both regional and global organizations should be on their guard,” Sygnia warned.\nA Java-Chugging Bug\nThis beetle adores Java. The group is “highly proficient” with Java-based attacks and often targets legacy Java apps running on Linux machines – primarily, the Java-based web servers WebSphere and WebLogic – as a means of initial entry to a target environment, the researchers explained. Beyond that, Elephant Beetle even deploys its own, complete Java web application to do the gang’s bidding on compromised machines that are, meanwhile, chugging along, running legitimate apps.\nSygnia’s full report (PDF) lays out Elephant Beetle’s modus operandi, in-depth analysis of its capabilities, actionable insights, incidents of compromise (IOCs) and guidelines for defending against the attacks.\nAttack Stages\nBut in a nutshell, here’s how the attack progresses:\nFor up to a month, the group builds operational cyber-capabilities in the compromised victim’s network, studying the digital landscape and planting backdoors, while customizing its tools to work within the victim’s network.\nThe attackers spend several months studying the victim’s environment, focusing on the financial operations and identifying any flaws. During this stage, Elephant Beetle observes the victim’s software and infrastructure to understand the technical process of legitimate financial transactions.\nNext, the group injects fraudulent transactions into the network. “These transactions mimic legitimate behavior and siphon off incremental amounts of money from the victim, a classic salami tactic,” Sygnia researchers explained, referring to the so-called salami slicing form of financial cyberattack, in which the ripped-off funds are so insignificant that a single case goes completely unnoticed. The amounts may seem trivial, but the group keeps stacking them up to what amounts to millions of dollars before the attackers move on.\nNo biggie if the group’s activity is discovered and blocked: They’ll just lay low for a few months, then circle back to target a different system.\nLateral movement flow chart. Source: Sygnia.\nPicking Apart Vulnerabilities\nThe group exploits known vulnerabilities to infiltrate organizations, then uses the compromised servers to establish persistent vectors in the network and to pivot to credential harvesting and lateral movement.\nSygnia observed the group using default credentials for authenticating myWebMethods (“WMS”) and the QLogic web management interface.\n“For example, the group leveraged the default password ‘manage’ of the privileged system user ‘sysadmin’ of WMS servers,” researchers detailed.\nElephant Beetle also exploited the following four vulnerabilities to gain network access:\nPrimefaces Application Expression Language Injection (CVE-2017-1000486).\nWebSphere Application Server SOAP Deserialization Exploit (CVE-2015-7450).\nSAP NetWeaver Invoker Servlet Exploit (CVE-2010-5326).\nSAP NetWeaver ConfigServlet Remote Code Execution (EDB-ID-24963).\nAll of the quartet of flaws enable the actors to execute arbitrary code remotely via a specially crafted and obfuscated web shell.\nThe security firm gave the following example of a web request that was sent by the threat group to one of the victim’s SAP portals. It exploits the SAP ConfigServlet remote code-execution issue and contains a one-line command that creates a web shell.\nSource: Sygnia.\nLaying Low\nIn order to stay undetected for months at a time, Elephant Beetle lays low, engaged in low or no activity, and/or mimicks its surroundings by doing things like dropping the web shells into the resources folders of each web app, or by disguising themselves as fonts, images, CSS and JS resources, with similar names to original files in these folders – but with a ‘.JSP’ extension.\nExample of web shells naming and location convention inside website resource folders. Source: Sygnia.\nThey ramp up when they’re ready to attack, using WAR archives to pack payloads. This tactic is considered to be “super-persistent” on some web servers, specifically WebSphere and WebMethods, “due to the fact that removal of the web shell files is insufficient, as the web pages are being loaded and held in the server’s process memory,” the researchers said.\nOther tactics, techniques and procedures (TTPs) used by the group include:\nModifying or replacing default web page files, enabling “almost guaranteed” access to their web shell from other servers or from the internet – access that’s not classified as suspicious.\nPen-testing tactics: Elephant Beetle uses a custom Java-written scanner that supports scanning IP range/list of IP addresses for a specific port or for an HTTP interface. “It is used to scan targets in the asset’s proximity and then leveraged to identify installed applications, which could be exploited,” Sygnia said. Other pen-testing TTPs included downloading app source code.\nMal Hombres\nSygnia found a number of ties to Spanish-speaking countries:\nHardcoded keywords and phrases in the group’s tools included, for example, a code variable named “ELEPHANTE” (mangled Spanish for elephant), as well as in output file names that the group uses, such as “windows_para_linux.”\nMost of the group’s command-and-control (C2) servers have IPs located in Mexico.\nThe group’s targets are mainly Latin American. “For example, one of the tools that the group uses to scan internal networks ‘p.j’ was uploaded to VirusTotal from Argentina,” Sygnia said. “This again suggests the group targets Spanish-speaking victims.”\nDefending Against Elefante Attacks\nKeeping up to date with patches is a no-brainer – particularly given how old the vulnerabilities are that Elephant Beetle is exploiting. Between that and other everyday security best practices, such as avoiding clear-text credentials used in scripts, Sygnia advised:\nAvoid using the ‘xp_cmdshell’ procedure and disable it on MS-SQL servers. Monitor for configuration changes and the use of ‘xp_cmdshell’.\nMonitor WAR deployments and validate that the packages deployment functionality is included in the logging policy of the relevant applications.\nHunt and monitor for the presence and creation of suspicious .class file in the WebSphere applications temp folders.\nMonitor for processes that were executed by either web server parent services processes (i.e., ‘w3wp.exe’, ‘tomcat6.exe’) or by database-related processes (i.e., ‘sqlservr.exe’).\nImplement and verify segregation between DMZ and internal servers.\nAs well, organizations would be well-advised to proactively hunt for Elephant Beetle IOCs and TTPs, which it listed in its report, within their networks.\nPassword Reset: On-Demand Event: Fortify 2022 with a password-security strategy built for today’s threats. This Threatpost Security Roundtable, built for infosec professionals, centers on enterprise credential management, the new password basics and mitigating post-credential breaches. Join Darren James, with Specops Software and Roger Grimes, defense evangelist at KnowBe4 and Threatpost host Becky Bracken. Register & stream this FREE session today – sponsored by Specops Software.\nImage courtesy of Phil. Licensing details.\nWrite a comment\nShare this article:\nMalware\nVulnerabilities\nWeb Security",
        "blog": "threat post",
        "url": "https://threatpost.com/elephant-beetle-months-networks-financial/177393/"
    },
    {
        "title": "Broward Breach Highlights Healthcare Supply-Chain Problems",
        "author": "Becky Bracken",
        "date": "2022-01-05T16:09:35-05:00",
        "text": "More than 1.3 million patient records were stolen in the just-disclosed breach, which occurred back in October.\nThis week’s announcement by Florida’s Broward Health System that the most intimate medical data of 1,357,879 of its patients was breached in the fall should serve as a warning that the healthcare software supply chain will be a juicy target for cybercriminals as we head into 2022, researchers warn.\nThe attackers breached the Broward Health network by compromising a third-party provider on Oct. 15, according to the organization’s disclosure, accessing: patient names; dates of birth; addresses; phone numbers; financial or bank information; Social-Security numbers; insurance information and account numbers; medical information including history, treatment and diagnosis; driver’s license numbers; and email addresses.\nIn response, Broward Health said that it has improved security and is offering victims a free two-year subscription for identity theft monitoring, adding the company has found “no indication that your personal information has been used to commit fraud.” Of course, this kind of information can have a long tail when it comes to cybercrime activity.\nBroward Health didn’t disclose the specific number of impacted patients in its statement but was obligated to provide the Maine Attorney General’s office with the staggering 1.3 million-plus figure.\nAs startling as the number of impacted Broward patients may seem, Ron Bradley, vice president of Shared Assessments calls this breach, “just a drop in the proverbial bucket related to healthcare losses in 2021.”\nHealthcare IT did the math and was able to find at least 40 million compromised patient records in 2021 reported to the U.S. federal government alone. To boot, numerous attacks to medical systems made healthcare the costliest industry for breaches to occur – the average cost-of-breach spiked to $9.23 million last year, up from $7.13 million in 2020.\nUnpatched and legacy systems, overwhelmed staff, an ocean of connected devices and a litany of third-party software providers leave healthcare organizations vulnerable to attack, with the latter vector likely to be more exploited in 2022.\nEven the simplest apps used in a healthcare setting can result in patient data exposure: Kaspersky found last month that 30 percent of healthcare providers reported instances where employees compromised patient data during remote consultations, often simply because the apps used for telehealth like FaceTime, Facebook Messenger, WhatsApp, Zoom and others weren’t built with patient privacy in mind.\nShoring Up the Healthcare Supply Chain\n“According to Broward Health, the breach occurred from a third-party service provider authorized to access Broward Health systems,” Bradley added. “While HIPAA and HITECH regulations have effectively added many layers of protection to the data-security onion, the fact remains, healthcare is still a soft target with high-value rewards.”\nThat means in addition to managing a pandemic, the healthcare industry needs to take a hard look at its software supply chain, Tim Erlin, vice president of product management and strategy with Tripwire explained in an email to Threatpost.\n“While it may not be practical for you to audit all of your suppliers directly, you can ask them what standards they comply with and how their audited against those standards,” Erlin explained. “Best practices from NIST and the Center for Internet Security provide a solid foundation for most organizations.”\nErlin added this is a task that should be done regularly.\n“It’s important to ask this question at least annually, as circumstances change,” Erlin advised. “This is a vital step to help safeguard the integrity of your organizations digital assets and protect against similar threats.”\nThe accelerating shift to the cloud is making healthcare data even more complex to secure, according to Adir Gruss, vice president of technical solutions at Laminar.\n“The biggest challenge impeding data-security teams today is that as more and more organizations move toward the cloud they have lost track of where sensitive data resides,” Gruss said. “You simply cannot protect what you don’t know about.”\nGruss advises teams to get a handle on their cloud data, including supply-chain access, and added, “with that knowledge, data-protection teams can move from gatekeepers to enablers.”\nRegarding Broward Health, David Strauss, co-founder and CTO of Pantheon told Threatpost that the fact that the October breach didn’t impact patient care is good news. But preventing what he sees as inevitable follow-on attacks should be a top priority.\nIn general, IT security teams across the healthcare sector should take a hard look at the software supply chain, he added.\n“As more organizations increase reliance on external services, IT administrators must consider the impacts of a security breach happening on either side, including how to notice a breach in the first place and prevent it from spreading,” Strauss explained. “Isolating infrastructure in different roles — patient healthcare systems, billing systems, public websites, intranets — can help a bad problem from becoming a worse one.”\nPassword Reset: On-Demand Event: Fortify 2022 with a password-security strategy built for today’s threats. This Threatpost Security Roundtable, built for infosec professionals, centers on enterprise credential management, the new password basics and mitigating post-credential breaches. Join Darren James, with Specops Software and Roger Grimes, defense evangelist at KnowBe4 and Threatpost host Becky Bracken. Register & stream this FREE session today – sponsored by Specops Software.\nWrite a comment\nShare this article:\nBreach\nIoT\nVulnerabilities\nWeb Security",
        "blog": "threat post",
        "url": "https://threatpost.com/broward-breach-healthcare-supply-chain/177401/"
    },
    {
        "title": "Uber Bug, Ignored for Years, Casts Doubt on Official Uber Emails",
        "author": "Tara Seals",
        "date": "2022-01-05T15:49:37-05:00",
        "text": "A simple-to-exploit bug that allows bad actors to send emails from Uber’s official system – skating past email security – went unaddressed despite flagging by multiple researchers.\nA security vulnerability that would allow malicious attackers to send email from Uber’s network appears to be closed – but users could have been swindled already. The easy-to-find bug has been hanging around for years, ready to take Uber’s customers for a ride of a very different sort.\nAccording to Seekurity security researcher and bug-hunter Seif Elsallamy, the HTML-injection issue made it possible to tap into an internet-facing internal Uber API endpoint in order to send out email directly from Uber’s email system (the company uses the SendGrid platform); since the emails would be coming from an authentic sender, they wouldn’t trigger normal email security filters like DMARC or DKIM.\nObviously, the bug opened a gaping opportunity for cyberattackers to send out social-engineering emails to the ride-sharing giant’s nearly 100 million users – perhaps a message asking them to “verify” their account info or “update” their credit-card information.\nElsallamy forwarded a proof-of-concept example of a possible attack email to BleepingComputer:\nThe danger seems particularly pertinent given that Uber suffered a data breach in 2016 that involved the email addresses of 57 million of its users, the researcher pointed out:\nheck this days with triage teams, they don't understand their own policies @Uber @Uber_Support @Hacker0x01 pic.twitter.com/kCQqwR3M3b\n— SAFE 😵 (@0x21SAFE) December 31, 2021\nHe also submitted a bug report via HackerOne to Uber, but the issue was rejected because the triage team mistakenly thought exploitation involved the social engineering of Uber employees:\nHi @Uber @Uber_Support bring your calc and tell me what would be the result if this vulnerability has been used with the 57 million email address that has been leaked from the last data breach?\nIf you know the result then tell your employees in the bug bounty triage team. pic.twitter.com/f9yKIoCJ6O\n— SAFE 😵 (@0x21SAFE) December 31, 2021\n  Making matters worse, he wasn’t the first to report it and be rebuffed; at least two other researchers filed the same issue, with the same result – one as long ago as 2015. That’s a lot of time for possible exploitation to have occurred.\n“I don’t have evidence that this bug has been exploited in the wild, but since the report has been duplicated, that means at least one researcher has reported it before me,” Elsallamy told Threatpost. “So, it looks like that it is an easy-to-spot issue [and] I hope that it has not been exploited in the wild. The exploitation was not difficult, it only requires basic HTML and CSS knowledge.”\ni reported this issue on @Hacker0x01 last year and triager closed it as informative xD pic.twitter.com/29yxgTV287\n— ${jndi:ldap://mainteemoforfun} (@wld_basha) January 2, 2022\n“The researchers and Uber’s employees are just doing their job, and I understand that Uber receives a lot of false reports,” Elsallamy told Threatpost. “But they have at least to spend five minutes in the report that had taken me days to prepare. Uber’s customers are who will pay for our faults in the end.”\nHe noted that a fix would be simple: “The issue is not difficult to fix, I think it will be only one or two lines of code,” he said. “They should sanitize the users’ input through security encoding library, so any HTML appears as a normal text.”\nSince the story was reported earlier this week, it appears that Uber has fixed the vulnerability – “because I am unable to reproduce the issue anymore,” Elsallamy said. However, because it’s unknown whether the vulnerability has been exploited in the years that it existed, customers who gave up personal information in response to an official Uber email should take action to change their passwords immediately.\nAdditionally, “I advise Uber customers to use unique passwords, use credit cards with a limited amount of money available online if they don’t want to hold cash, and to use two-factor authentication whenever possible to limit the damage if any of their data has been compromised,” he said.\nUber did not immediately return a request to comment on this story.\nPassword Reset: On-Demand Event: Fortify 2022 with a password-security strategy built for today’s threats. This Threatpost Security Roundtable, built for infosec professionals, centers on enterprise credential management, the new password basics and mitigating post-credential breaches. Join Darren James, with Specops Software and Roger Grimes, defense evangelist at KnowBe4 and Threatpost host Becky Bracken. Register & stream this FREE session today – sponsored by Specops Software.\n  Write a comment\nShare this article:\nVulnerabilities\nWeb Security",
        "blog": "threat post",
        "url": "https://threatpost.com/uber-bug-ignored-emails/177395/"
    }
]